{
  "compendium": {
    "@version": "5",
    "@auto_indent": "NO",
    "monster": [
      {
        "name": "Aarakocra Aeromancer [2024]",
        "size": "M",
        "type": "elemental",
        "alignment": "neutral",
        "ac": "16",
        "hp": "66 (12d8+12)",
        "speed": "20 ft., fly 50 ft.",
        "init": "3",
        "str": "10",
        "dex": "16",
        "con": "12",
        "int": "13",
        "wis": "17",
        "cha": "12",
        "save": "Wis +5, Dex +5",
        "skill": "Nature +5, Arcana +3, Perception +7",
        "passive": "17",
        "languages": "Aarakocra, Primordial (Auran)",
        "cr": "4",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+2"
          },
          {
            "name": "Treasure",
            "text": "Implements: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme.\nIndividual: The monster doesn't have a treasure hoard, but it might keep monetary treasure."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The aarakocra makes two Wind Staff attacks, and it can use Spellcasting to cast Gust of Wind."
          },
          {
            "name": "Wind Staff",
            "text": "Melee or Ranged Attack Roll: +5, reach 5 ft. or range 120 ft. Hit: 7 (1d8 + 3) Bludgeoning damage plus 11 (2d10) Lightning damage.",
            "attack": [
              "Wind Staff|+5|1d8+3",
              "Lightning Damage||2d10"
            ]
          },
          {
            "name": "Spellcasting",
            "text": "The aarakocra casts one of the following spells, requiring no Material components and using Wisdom as the spellcasting ability (spell save DC 13):\n\n\t• At will: Elementalism, Gust of Wind, Mage Hand, Message\n\t• 1/Day: Lightning Bolt"
          }
        ],
        "reaction": {
          "name": "Feather Fall (1/Day)",
          "recharge": "1/DAY",
          "text": "The aarakocra casts Feather Fall in response to that spell's trigger, using the same spellcasting ability as Spellcasting."
        },
        "spells": "Elementalism [2024], Gust of Wind [2024], Mage Hand [2024], Message [2024], Lightning Bolt [2024]",
        "description": "Aarakocra are birdlike folk who soar the skies of countless worlds and the endless expanses of the Elemental Plane of Air. They often resemble avians common to the lands where they dwell; some resemble hawks or condors, while others appear similar to hummingbirds or archaeopteryxes. In many lands, aarakocra tell of their ancient heroics resisting the wicked Queen of Chaos alongside the mysterious Wind Dukes of Aaqa.\n\nAarakocra aeromancers control magical winds from the endless storms of the Elemental Plane of Air.\n\nSource:\tMonster Manual 2024 p. 10",
        "environment": "mountain, planar (elemental plane of air)"
      },
      {
        "name": "Aarakocra Skirmisher [2024]",
        "size": "M",
        "type": "elemental",
        "alignment": "neutral",
        "ac": "12",
        "hp": "11 (2d8+2)",
        "speed": "20 ft., fly 50 ft.",
        "init": "2",
        "str": "10",
        "dex": "14",
        "con": "12",
        "int": "11",
        "wis": "12",
        "cha": "11",
        "save": null,
        "skill": "Perception +5",
        "passive": "15",
        "languages": "Aarakocra, Primordial (Auran)",
        "cr": "1/4",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+2"
          },
          {
            "name": "Treasure",
            "text": "Implements: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme.\nIndividual: The monster doesn't have a treasure hoard, but it might keep monetary treasure."
          }
        ],
        "action": [
          {
            "name": "Talons",
            "text": "Melee Attack Roll: +4, reach 5 ft. Hit: 4 (1d4 + 2) Slashing damage, or 9 (3d4 + 2) Slashing damage if the aarakocra moved 30+ feet straight toward the target immediately before the hit.",
            "attack": "Talons|+4|1d4+2+3d4+2"
          },
          {
            "name": "Wind Javelin",
            "text": "Melee or Ranged Attack Roll: +4, reach 5 ft. or range 30/120 ft. Hit: 5 (1d6 + 2) Piercing damage plus 2 (1d4) Thunder damage. Hit or Miss: The javelin magically returns to the aarakocra's hand immediately after a ranged attack.",
            "attack": [
              "Wind Javelin|+4|1d6+2",
              "Thunder Damage||1d4"
            ]
          }
        ],
        "description": "Aarakocra are birdlike folk who soar the skies of countless worlds and the endless expanses of the Elemental Plane of Air. They often resemble avians common to the lands where they dwell; some resemble hawks or condors, while others appear similar to hummingbirds or archaeopteryxes. In many lands, aarakocra tell of their ancient heroics resisting the wicked Queen of Chaos alongside the mysterious Wind Dukes of Aaqa.\n\nAarakocra skirmishers are adept at fighting aerial foes amid the clouds. They often attack land-bound threats with diving strikes from above.\n\nSource:\tMonster Manual 2024 p. 10",
        "environment": "mountain, planar (elemental plane of air)"
      },
      {
        "name": "Aberrant Cultist [2024]",
        "sortname": "Cultist, Aberrant",
        "ancestry": "Cultist",
        "size": "S",
        "type": "humanoid",
        "alignment": "neutral evil",
        "ac": "14",
        "hp": "137 (25d8+25)",
        "speed": "30 ft.",
        "init": "7",
        "str": "10",
        "dex": "19",
        "con": "12",
        "int": "16",
        "wis": "18",
        "cha": "15",
        "save": "Wis +7, Int +6",
        "skill": "Arcana +6, Perception +7, Religion +6",
        "passive": "17",
        "languages": "Common, Deep Speech; telepathy 30 ft.",
        "cr": "8",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": "darkvision 90 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+3"
          },
          {
            "name": "Treasure",
            "text": "Individual: The monster doesn't have a treasure hoard, but it might keep monetary treasure.\nRelics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Size",
            "text": "Small, Medium"
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The cultist makes two Tentacle Lash attacks. It can replace any attack with a use of Mind Rot."
          },
          {
            "name": "Tentacle Lash",
            "text": "Melee Attack Roll: +7, reach 10 ft. Hit: 7 (1d6 + 4) Slashing damage plus 14 (4d6) Psychic damage. If the target is a Large or smaller creature, it has the Grappled condition (escape DC 14) from one of two tentacles, and it has the Restrained condition until the grapple ends.",
            "attack": [
              "Tentacle Lash|+7|1d6+4",
              "Psychic Damage||4d6"
            ]
          },
          {
            "name": "Mind Rot",
            "text": "Wisdom Saving Throw: DC 15, one creature the cultist can see within 90 feet. Failure: 27 (6d8) Psychic damage, and the target has the Poisoned condition until the start of the cultist's next turn. Success: Half damage only.",
            "attack": "Mind Rot||6d8"
          },
          {
            "name": "Spellcasting",
            "text": "The cultist casts one of the following spells, using Wisdom as the spellcasting ability (spell save DC 15):\n\n\t• At will: Detect Thoughts, Minor Illusion"
          }
        ],
        "reaction": {
          "name": "Counterspell (2/Day)",
          "recharge": "2/DAY",
          "text": "The cultist casts Counterspell in response to that spell's trigger, using the same spellcasting ability as Spellcasting."
        },
        "spells": "Detect Thoughts [2024], Minor Illusion [2024]",
        "description": "Cultists use magic and extreme measures to spread radical beliefs. Some privately pursue esoteric secrets, while others form shadowy cabals seeking to bring about terrifying ends. Cultists often follow obscure mystical traditions or obsess over interpretations of ancient prophecies. They might worship supernatural patrons—deities, otherworldly creatures, manipulative alien minds, or stranger forces. Roll on or choose a result from the Cultist Agendas table to inspire what a cultist seeks to achieve.\n\nCultist Agendas:\n1d6 | The Cultist Strives To...\n1 | Bring about the end of a dominant order, an age, or the world.\n2 | Burn away the comfortable lies of reality, revealing forgotten or terrible truths.\n3 | Expand their faith through mind control or supernatural coercion.\n4 | Make global changes, like sinking the land or awakening volcanoes.\n5 | Remake life on a mass scale, altering other creatures' bodies or spiritual beings.\n6 | Summon their deity or its herald, weapon, or realm into their world.\n\nOccult Symbols:\nCults often identify with symbols that exemplify their beliefs. Such symbols might mark objects important to the cult, as well as the dress and bodies of cultists themselves. These symbols might be broadly understandable, or they might have meaning only to cultists. Roll twice on or choose results from the Cult Symbols table to inspire a cult's icons.\n\nCult Symbols:\n1d10 | The Symbol Is... Depicted As...\n1 | An alchemical sign A calendar or map\n2 | An animal A crest or as heraldry\n3 | A celestial body An elaborate diagram\n4 | A deity's icon A metaphorical image\n5 | An element A mystical being\n6 | An eye Part of an equation\n7 | A geometric shape A repeating pattern\n8 | A letter or number A series of scratches\n9 | Part of a monster A simple pictogram\n10 | A skull A weapon or tool\n\nCult Members:\nCults often form hierarchies around a charismatic or domineering leader. While cult members might work independently, they take their orders from superiors with greater supernatural powers. Any cult might have the following sorts of members.\n\nTypes of Cultists:\nCults can organize around any mystical tradition, but many serve supernatural beings. Cult members often have abilities tied to the forces they worship.\n\nAberrant Cultists:\nAberrant cultists pursue mind-bending powers from alien forces. Aberrant cultists align with monsters such as aboleths and mind flayers or forces such as Cthulhu, Hadar, Ityak-Ortheel the Elf Eater, Nyarlathotep, malicious solar bodies, or entities from the Far Realm.\n\nSource:\tMonster Manual 2024 p. 86",
        "environment": "any"
      },
      {
        "name": "Aboleth [2024]",
        "size": "L",
        "type": "aberration",
        "alignment": "lawful evil",
        "ac": "17",
        "hp": "150 (20d10+40)",
        "speed": "10 ft., swim 40 ft.",
        "init": "8",
        "str": "21",
        "dex": "9",
        "con": "15",
        "int": "18",
        "wis": "15",
        "cha": "18",
        "save": "Wis +6, Con +6, Dex +3, Int +8",
        "skill": "History +12, Perception +10",
        "passive": "20",
        "languages": "Deep Speech; telepathy 120 ft.",
        "cr": "10",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": "darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+4"
          },
          {
            "name": "Treasure",
            "text": "Relics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The aboleth can breathe air and water."
          },
          {
            "name": "Eldritch Restoration",
            "text": "If destroyed, the aboleth gains a new body in 5d10 days, reviving with all its Hit Points in the Far Realm or another location chosen by the DM.",
            "attack": "Eldritch Restoration||5d10"
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the aboleth fails a saving throw, it can choose to succeed instead."
          },
          {
            "name": "Mucus Cloud",
            "text": "While underwater, the aboleth is surrounded by mucus. Constitution Saving Throw: DC 14, each creature in a 5-foot Emanation originating from the aboleth at the end of the aboleth's turn. Failure: The target is cursed. Until the curse ends, the target's skin becomes slimy, the target can breathe air and water, and it can't regain Hit Points unless it is underwater.\n\tWhile the cursed creature is outside a body of water, the creature takes 6 (1d12) Acid damage at the end of every 10 minutes unless moisture is applied to its skin before those minutes have passed.",
            "attack": "Mucus Cloud||1d12"
          },
          {
            "name": "Probing Telepathy",
            "text": "If a creature the aboleth can see communicates telepathically with the aboleth, the aboleth learns the creature's greatest desires."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The aboleth makes two Tentacle attacks and uses either Consume Memories or Dominate Mind if available."
          },
          {
            "name": "Tentacle",
            "text": "Melee Attack Roll: +9, reach 15 ft. Hit: 12 (2d6 + 5) Bludgeoning damage. If the target is a Large or smaller creature, it has the Grappled condition (escape DC 14) from one of four tentacles.",
            "attack": "Tentacle|+9|2d6+5"
          },
          {
            "name": "Consume Memories",
            "text": "Intelligence Saving Throw: DC 16, one creature within 30 feet that is Charmed or Grappled by the aboleth. Failure: 10 (3d6) Psychic damage. Success: Half damage. Failure or Success: The aboleth gains the target's memories if the target is a Humanoid and is reduced to 0 Hit Points by this action.",
            "attack": "Consume Memories||3d6"
          },
          {
            "name": "Dominate Mind (2/Day)",
            "recharge": "2/DAY",
            "text": "Wisdom Saving Throw: DC 16, one creature the aboleth can see within 30 feet. Failure: The target has the Charmed condition until the aboleth dies or is on a different plane of existence from the target. While Charmed, the target acts as an ally to the aboleth and is under its control while within 60 feet of it. In addition, the aboleth and the target can communicate telepathically with each other over any distance.\n\tThe target repeats the save whenever it takes damage as well as after every 24 hours it spends at least 1 mile away from the aboleth, ending the effect on itself on a success."
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Aboleth can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Aboleth regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Lash",
            "text": "The aboleth makes one Tentacle attack."
          },
          {
            "name": "Psychic Drain",
            "text": "If the aboleth has at least one creature Charmed or Grappled, it uses Consume Memories and regains 5 (1d10) Hit Points.",
            "attack": "Psychic Drain||1d10"
          },
          {
            "@category": "lair",
            "name": "Aboleth Lairs\nAboleths usually dwell in submerged ruins and caverns",
            "text": "Aboleths usually dwell in submerged ruins and caverns.  They keep air-filled spaces for their terrestrial servants and to hold treasures that would be damaged by water.\n\nThe region containing an aboleth's lair is warped by it, creating the following effects:\n\nFoul Water: Water sources within 1 mile of the lair are supernaturally fouled. Creatures other than the aboleth and its allies that drink such water must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour.\n\nPsionic Projection: While in its lair, the aboleth can cast Project Image, requiring no spell components and using Intelligence as the spellcasting ability (spell save DC 16). When casting the spell this way, the spell's range is 1 mile, and the aboleth can use its telepathy as if it were in the illusion's space. If the aboleth dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Project Image [2024]",
        "description": "In aquatic abysses, aboleths dream of dead empires and orchestrate plots that unfold across ages. These elusive, amphibious immortals physically and mentally overwhelm their victims and transform creatures with a slimy, aberrant infection, reshaping other beings to serve them beneath the waves.\n\nAboleths possess terrifying intellects and have alien mindsets. These creatures possess perfect memories of proto-worlds and incomprehensible dominions from the multiverse's earliest eons. Their secrets are innumerable and unfathomable. Aboleths lurk in places awash in primordial mysteries: the ruins of aquatic empires, hidden magical nexuses, or weak places between planes of existence. In these lairs, aboleths dream of epochs past, collect throngs of psychically dominated servants, consume the minds of unwitting victims, and prepare for their return to power.\n\nAboleths' alien goals and methods are often mysterious to other creatures. Roll on or choose a result from the Aboleth Schemes table to inspire an aboleth's schemes.\n\nAboleth Schemes:\n1d6 | The Aboleth Seeks To...\n1 | Accomplish incomprehensible plans that lead it to act in seemingly random ways.\n2 | Learn more of the world by kidnapping people and consuming their minds.\n3 | Manipulate innocents into worshiping it as a god by using its telepathy from hiding.\n4 | Open a gate to the distant past or future, releasing an invasion from another time.\n5 | Rouse a dragon turtle, a kraken, or another sea monster to flood a coastal city.\n6 | Trick treasure hunters into recovering relics from its long-fallen empire.\n\nSource:\tMonster Manual 2024 p. 12",
        "environment": "underdark, underwater"
      },
      {
        "name": "Abominable Yeti [2024]",
        "sortname": "Yeti, Abominable",
        "ancestry": "Yeti",
        "size": "H",
        "type": "monstrosity",
        "alignment": "chaotic evil",
        "ac": "15",
        "hp": "137 (11d12+66)",
        "speed": "40 ft., climb 40 ft.",
        "init": "4",
        "str": "24",
        "dex": "10",
        "con": "22",
        "int": "9",
        "wis": "13",
        "cha": "9",
        "save": null,
        "skill": "Stealth +8, Perception +9",
        "passive": "19",
        "languages": "Yeti",
        "cr": "9",
        "vulnerable": null,
        "resist": null,
        "immune": "cold",
        "conditionImmune": null,
        "senses": "darkvision 60 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+4"
          },
          {
            "name": "Treasure",
            "text": "Any: The monster's treasure hoard can include monetary treasure and any kinds of magic items."
          },
          {
            "name": "Fear of Fire",
            "text": "If the yeti takes Fire damage, it has Disadvantage on attack rolls and ability checks until the end of its next turn."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The yeti can use its Chilling Gaze and makes two attacks, using Claw or Ice Throw in any combination."
          },
          {
            "name": "Claw",
            "text": "Melee Attack Roll: +11, reach 5 ft. Hit: 14 (2d6 + 7) Slashing damage plus 7 (2d6) Cold damage.",
            "attack": [
              "Claw|+11|2d6+7",
              "Cold Damage||2d6"
            ]
          },
          {
            "name": "Ice Throw",
            "text": "Ranged Attack Roll: +11, range 60/240 ft. Hit: 12 (2d4 + 7) Bludgeoning damage plus 7 (2d6) Cold damage.",
            "attack": [
              "Ice Throw|+11|2d4+7",
              "Cold Damage||2d6"
            ]
          },
          {
            "name": "Chilling Gaze",
            "text": "Constitution Saving Throw: DC 18, one creature the yeti can see within 30 feet. Failure: 21 (6d6) Cold damage, and the target has the Paralyzed condition until the start of the yeti's next turn unless the target has Immunity to Cold damage. Success: The target is immune to this yeti's Chilling Gaze for 1 hour.",
            "attack": "Chilling Gaze||6d6"
          },
          {
            "name": "Cold Breath (Recharge 6)",
            "recharge": "D6",
            "text": "Constitution Saving Throw: DC 18, each creature in a 30-foot Cone. Failure: 45 (10d8) Cold damage. Success: Half damage.",
            "attack": "Cold Breath||10d8"
          }
        ],
        "description": "Across alpine extremes and frozen frontiers, yetis hunt those that trespass in their territories. Reclusive and merciless, they resemble giant apes with pale fur and ram-like horns. Yetis easily blend in with snow and icy cliffs, revealing themselves with blood-chilling howls just before striking with their icy claws. In addition to their physical might, yetis can chill creatures with a look, freezing their foes in place, and they can conjure ice and hurl it at foes.\n\tDue to yetis' elusiveness, folktales about yetis are more common than sightings. Whether a distant scream is the howl of an enraged yeti or just the wind, few can be certain. Nevertheless, many mountainous settlements burn bonfires to ward off yetis, taking advantage of these brutes' aversion to fire.\n\nAbominable Yeti:\nGiants even among their own intimidating kind, abominable yetis are stronger and bloodthirstier than their kin. They claim whole regions as their hunting grounds, and they might track trespassers for days. On sighting prey, abominable yetis fling boulders of ice and snow before closing to finish foes. In addition to their icy claws and gaze, they can exhale a blast of arctic cold.\n\tAbominable yetis dwell in frigid ruins or the deserted lairs of other monsters atop infamous peaks.\n\nSource:\tMonster Manual 2024 p. 340",
        "environment": "arctic"
      },
      {
        "name": "Adult Black Dragon [2024]",
        "sortname": "Black Dragon, Adult",
        "ancestry": "Black Dragon",
        "size": "H",
        "type": "dragon (chromatic)",
        "alignment": "chaotic evil",
        "ac": "19",
        "hp": "195 (17d12+85)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "12",
        "str": "23",
        "dex": "14",
        "con": "21",
        "int": "14",
        "wis": "13",
        "cha": "19",
        "save": "Wis +6, Dex +7",
        "skill": "Stealth +7, Perception +11",
        "passive": "21",
        "languages": "Common, Draconic",
        "cr": "14",
        "vulnerable": null,
        "resist": null,
        "immune": "acid",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Relics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Melf's Acid Arrow (level 3 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +11, reach 10 ft. Hit: 13 (2d6 + 6) Slashing damage plus 4 (1d8) Acid damage.",
            "attack": [
              "Rend|+11|2d6+6",
              "Acid Damage||1d8"
            ]
          },
          {
            "name": "Acid Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 18, each creature in a 60-foot-long, 5-foot-wide Line. Failure: 54 (12d8) Acid damage. Success: Half damage.",
            "attack": "Acid Breath||12d8"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 17, +9 to hit with spell attacks):\n\nAt will: Detect Magic, Fear, Melf's Acid Arrow (level 3 version)\n1/Day each: Speak with Dead, Vitriolic Sphere"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Black Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Black Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Cloud of Insects",
            "text": "Dexterity Saving Throw: DC 17, one creature the dragon can see within 120 feet. Failure: 22 (4d10) Poison damage, and the target has Disadvantage on saving throws to maintain Concentration until the end of its next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Poison Damage||4d10"
          },
          {
            "name": "Frightful Presence",
            "text": "The dragon uses Spellcasting to cast Fear. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon can move up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Black Dragon Lairs\nBlack dragons lurk in dismal ruins, polluted bogs, or other sites gripped by decay",
            "text": "Black dragons lurk in dismal ruins, polluted bogs, or other sites gripped by decay.\n\tThe region containing an adult or ancient black dragon's lair is warped by its presence, creating the following effects:\n\nAcrid Haze: Odorous and stifling fog covers the area within 1 mile of the lair, rendering that area Lightly Obscured. Travel for creatures other than the dragon and its allies takes twice the usual time in that area.\n\nFoul Water: Water sources within 1 mile of the lair are supernaturally fouled. A creature that drinks such water must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Fear [2024], Melf's Acid Arrow [2024], Speak With Dead [2024], Vitriolic Sphere [2024]",
        "description": "Black dragons delight in suffering and ruin. While other chromatic dragons scheme for power and wealth, these dragons seek to tear down all they see and rule over what remains.\n\tBlack dragons are terrifying creatures with curved horns and withered visages suggestive of fiendish skulls. They typically inhabit stagnant swamps, crumbling ruins, or places of magical or environmental corruption. Their acid breath scars their domains, eroding the features from ancient statues and leaving nature with festering wounds.\n\tBlack dragons hoard tarnished symbols of hope and relics of fallen empires. The more sought-after the treasure, the more black dragons prize it—particularly if they were responsible for it being lost.\n\nAdult Black Dragon:\nBy the time they're adults, black dragons are among the greatest terrors in the lands they claim. Wretched swamps and monster-haunted ruins grow more dismal and spread under an adult black dragon's influence. Morbid cultists and doomsayers frequently gather in the dragon's service, bringing with them undead terrors that answer to the black dragon and aid it in spreading ruin to nearby bastions of beauty and peace.\n\nSource:\tMonster Manual 2024 p. 39",
        "environment": "swamp"
      },
      {
        "name": "Adult Blue Dragon [2024]",
        "sortname": "Blue Dragon, Adult",
        "ancestry": "Blue Dragon",
        "size": "H",
        "type": "dragon (chromatic)",
        "alignment": "lawful evil",
        "ac": "19",
        "hp": "212 (17d12+102)",
        "speed": "40 ft., fly 80 ft., burrow 30 ft.",
        "init": "10",
        "str": "25",
        "dex": "10",
        "con": "23",
        "int": "16",
        "wis": "15",
        "cha": "20",
        "save": "Wis +7, Dex +5",
        "skill": "Stealth +5, Perception +12",
        "passive": "22",
        "languages": "Common, Draconic",
        "cr": "16",
        "vulnerable": null,
        "resist": null,
        "immune": "lightning",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Relics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Shatter."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +12, reach 10 ft. Hit: 16 (2d8 + 7) Slashing damage plus 5 (1d10) Lightning damage.",
            "attack": [
              "Rend|+12|2d8+7",
              "Lightning Damage||1d10"
            ]
          },
          {
            "name": "Lightning Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 19, each creature in a 90-foot-long, 5-foot-wide Line. Failure: 60 (11d10) Lightning damage. Success: Half damage.",
            "attack": "Lightning Breath||11d10"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 18):\n\n\t• At will: Detect Magic, Invisibility, Mage Hand, Shatter\n\t• 1/Day each: Scrying, Sending"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Blue Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Blue Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Cloaked Flight",
            "text": "The dragon uses Spellcasting to cast Invisibility on itself, and it can fly up to half its Fly Speed. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Sonic Boom",
            "text": "The dragon uses Spellcasting to cast Shatter. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Tail Swipe",
            "text": "The dragon makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Blue Dragon Lairs",
            "text": "Blue dragons dwell in arid lands. Their lairs might be death traps meant to entomb invaders or ostentatious fortresses where they plot domination.\n\tThe region containing an adult or ancient blue dragon's lair is changed by its presence, creating the following effects:\n\nSinkholes: Sinkholes form more frequently in the area within 1 mile of the lair. Whenever a creature in that area other than the dragon and its allies finishes a Long Rest, roll 1d20. On a 1, a sinkhole opens beneath the creature, and the creature must succeed on a DC 15 Dexterity saving throw or fall 2d4 × 10 feet into the sinkhole.\n\nSpiteful Storms: Dust devils and thunderstorms rage within 1 mile of the lair. The area is Lightly Obscured.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Invisibility [2024], Mage Hand [2024], Shatter [2024], Scrying [2024], Sending [2024]",
        "description": "Arrogant and imperious, blue dragons are chromatic dragons that crave control and collect followers like other dragons hoard treasure. They seek to transform their territories into empires, domains to be feared by nations.\n\tBlue dragons have sharp features with piercing horns and scales that range from sapphire to the shades of stormy skies. They dwell in deserts and badlands, particularly regions with dramatic spires from whose tops they might see for miles. They seek lairs near sites of symbolic power, such as the abandoned fortresses of giants, the colossi of fallen empires, or monuments raised by their followers.\n\tRegalia of rulership and artistic masterpieces fill blue dragons' hoards. These dragons have no interest in treasures that are common or flawed, preferring one-of-a-kind gemstones, the crowns of fallen royals, and magic items capable of spreading the dragons' influence.\n\nAdult Blue Dragon:\nAdult blue dragons command small empires, which might be territories of subjugated followers, shadowy criminal networks, or cultic enclaves. Endlessly suspicious and wary of rivals, these dragons enact elaborate schemes to ruin their foes, test the loyalty of their servants, and ensure their dominance for centuries.\n\nSource:\tMonster Manual 2024 p. 49",
        "environment": "coastal, desert"
      },
      {
        "name": "Adult Brass Dragon [2024]",
        "sortname": "Brass Dragon, Adult",
        "ancestry": "Brass Dragon",
        "size": "H",
        "type": "dragon (metallic)",
        "alignment": "chaotic good",
        "ac": "18",
        "hp": "172 (15d12+75)",
        "speed": "40 ft., fly 80 ft., burrow 30 ft.",
        "init": "10",
        "str": "23",
        "dex": "10",
        "con": "21",
        "int": "14",
        "wis": "13",
        "cha": "17",
        "save": "Wis +6, Dex +5",
        "skill": "Persuasion +8, Stealth +5, History +7, Perception +11",
        "passive": "21",
        "languages": "Common, Draconic",
        "cr": "13",
        "vulnerable": null,
        "resist": null,
        "immune": "fire",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Sleep Breath or (B) Spellcasting to cast Scorching Ray."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +11, reach 10 ft. Hit: 17 (2d10 + 6) Slashing damage plus 4 (1d8) Fire damage.",
            "attack": [
              "Rend|+11|2d10+6",
              "Fire Damage||1d8"
            ]
          },
          {
            "name": "Fire Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 18, each creature in a 60-foot-long, 5-foot-wide Line. Failure: 45 (10d8) Fire damage. Success: Half damage.",
            "attack": "Fire Breath||10d8"
          },
          {
            "name": "Sleep Breath",
            "text": "Constitution Saving Throw: DC 18, each creature in a 60-foot Cone. Failure: The target has the Incapacitated condition until the end of its next turn, at which point it repeats the save. Second Failure: The target has the Unconscious condition for 10 minutes. This effect ends for the target if it takes damage or a creature within 5 feet of it takes an action to wake it."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 16):\n\n\t• At will: Detect Magic, Minor Illusion, Scorching Ray, Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell), Speak with Animals\n\t• 1/Day each: Detect Thoughts, Control Weather"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Brass Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Brass Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Blazing Light",
            "text": "The dragon uses Spellcasting to cast Scorching Ray."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "name": "Scorching Sands",
            "text": "Dexterity Saving Throw: DC 16, one creature the dragon can see within 120 feet. Failure: 27 (6d8) Fire damage, and the target's Speed is halved until the end of its next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Scorching Sands||6d8"
          },
          {
            "@category": "lair",
            "name": "Brass Dragon Lairs",
            "text": "Brass dragons usually dwell in secret caves and canyons near well-traveled routes.\n\tThe area containing an adult or ancient brass dragon's lair is altered by its presence, creating the following effects:\n\nMirages: While in its lair, the dragon can cast Major Image , requiring no Material components and using the same spellcasting ability as its Spellcasting action. When casting the spell this way, the spell's range is 1 mile, and the dragon doesn't need to see the spot where the illusion appears.\n\nRefreshing Water: Water within 1 mile of the lair is magically refreshing. A creature that drinks such water gains 2d4 Temporary Hit Points, and the dragon is immediately aware of the creature's presence.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Minor Illusion [2024], Scorching Ray [2024], Shapechange [2024], Speak With Animals [2024], Detect Thoughts [2024], Control Weather [2024]",
        "description": "Gregarious and outgoing, brass dragons relish sharing knowledge and stories. Although these metallic dragons favor arid lands, they cheerfully journey considerable distances to visit friendly creatures, pass on what they've learned, and collect news. Though good natured, brass dragons don't shirk from combat when necessary, thwarting foes with magical sleep and searing them with flame.\n\tBrass dragons favor warm climes, particularly steppes and rocky or sandy deserts, and they usually dwell near prominent crossroads or oases that regularly draw visitors. They enjoy adopting Humanoid forms, disguising themselves as traveling merchants, scholars, storytellers, or anyone else invested in others' stories.\n\tBrass dragons collect eclectic objects. While such items might seem like knickknacks, each is part of a story—perhaps a nostalgic memento or evidence of a tale passed into myth. An old friend's hat and the crown of the last ruler of a forgotten dynasty could occupy the same shelf in a brass dragon's hoard.\n\nAdult Brass Dragon:\nAdult brass dragons know many secrets and have vast networks of contacts. These dragons share perspectives they've learned from across the world and passionately combat the lies of con artists and villains that lead people astray.\n\nSource:\tMonster Manual 2024 p. 55",
        "environment": "desert"
      },
      {
        "name": "Adult Bronze Dragon [2024]",
        "sortname": "Bronze Dragon, Adult",
        "ancestry": "Bronze Dragon",
        "size": "H",
        "type": "dragon (metallic)",
        "alignment": "lawful good",
        "ac": "18",
        "hp": "212 (17d12+102)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "10",
        "str": "25",
        "dex": "10",
        "con": "23",
        "int": "16",
        "wis": "15",
        "cha": "20",
        "save": "Wis +7, Dex +5",
        "skill": "Insight +7, Stealth +5, Perception +12",
        "passive": "22",
        "languages": "Common, Draconic",
        "cr": "15",
        "vulnerable": null,
        "resist": null,
        "immune": "lightning",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Implements: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Repulsion Breath or (B) Spellcasting to cast Guiding Bolt (level 2 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +12, reach 10 ft. Hit: 16 (2d8 + 7) Slashing damage plus 5 (1d10) Lightning damage.",
            "attack": [
              "Rend|+12|2d8+7",
              "Lightning Damage||1d10"
            ]
          },
          {
            "name": "Lightning Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 19, each creature in a 90-foot-long, 5-foot-wide Line. Failure: 55 (10d10) Lightning damage. Success: Half damage.",
            "attack": "Lightning Breath||10d10"
          },
          {
            "name": "Repulsion Breath",
            "text": "Strength Saving Throw: DC 19, each creature in a 30-foot Cone. Failure: The target is pushed up to 60 feet straight away from the dragon and has the Prone condition."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 17, +10 to hit with spell attacks):\n\n\t• At will: Detect Magic, Guiding Bolt (level 2 version), Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell), Speak with Animals, Thaumaturgy\n\t• 1/Day each: Detect Thoughts, Water Breathing"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Bronze Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Bronze Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Guiding Light",
            "text": "The dragon uses Spellcasting to cast Guiding Bolt (level 2 version)."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "name": "Thunderclap",
            "text": "Constitution Saving Throw: DC 17, each creature in a 20-foot-radius Sphere centered on a point the dragon can see within 90 feet. Failure: 10 (3d6) Thunder damage, and the target has the Deafened condition until the end of its next turn.",
            "attack": "Thunderclap||3d6"
          },
          {
            "@category": "lair",
            "name": "Bronze Dragon Lairs",
            "text": "Bronze dragons usually make their homes near or under the sea.\n\tThe region containing an adult or ancient bronze dragon's lair is changed by its presence, creating the following effects:\n\nBuoying Currents: Creatures within 1 mile of the lair that lack a Swim Speed ignore the extra cost of movement while swimming.\n\nSun and Storms: While in its lair, the dragon can cast Contr ol W eather , requiring no Material components and using the same spellcasting ability as its Spellcasting action. When casting the spell this way, the dragon can control the weather within 1 mile of its lair, regardless if the dragon is inside or outside.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Guiding Bolt [2024], Shapechange [2024], Speak With Animals [2024], Thaumaturgy [2024], Detect Thoughts [2024], Water Breathing [2024]",
        "description": "Where bronze dragons dwell, wonders flourish. Imaginative yet mindful, these metallic dragons work toward greatness and help others achieve all they can. They strive to preserve innovations, from the works of past civilizations to new discoveries, and they share such works widely. When dealing with shorter-lived beings, bronze dragons prefer to win them over through conversation and cultivation, but they don't shy from battle when villains keep others from achieving their potential.\n\tBronze dragons enjoy the power and endless possibilities of the sea, and they often make their lairs in places of natural beauty or communities they wish to preserve. Within their dwellings, bronze dragons hoard things they believe will be useful one day. They salvage treasure lost to the sea, reclaiming wealth or sunken ships.\n\nAdult Bronze Dragon:\nAdult bronze dragons often dwell near places they defend or where they help others work toward goals. They might become patrons of whole cities, advising leaders and helping generations flourish.\n\nSource:\tMonster Manual 2024 p. 59",
        "environment": "coastal"
      },
      {
        "name": "Adult Copper Dragon [2024]",
        "sortname": "Copper Dragon, Adult",
        "ancestry": "Copper Dragon",
        "size": "H",
        "type": "dragon (metallic)",
        "alignment": "chaotic good",
        "ac": "18",
        "hp": "184 (16d12+80)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "init": "11",
        "str": "23",
        "dex": "12",
        "con": "21",
        "int": "18",
        "wis": "15",
        "cha": "18",
        "save": "Wis +7, Dex +6",
        "skill": "Deception +9, Stealth +6, Perception +12",
        "passive": "22",
        "languages": "Common, Draconic",
        "cr": "14",
        "vulnerable": null,
        "resist": null,
        "immune": "acid",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Slowing Breath or (B) Spellcasting to cast Mind Spike (level 4 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +11, reach 10 ft. Hit: 17 (2d10 + 6) Slashing damage plus 4 (1d8) Acid damage.",
            "attack": [
              "Rend|+11|2d10+6",
              "Acid Damage||1d8"
            ]
          },
          {
            "name": "Acid Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 18, each creature in an 60-foot-long, 5-foot-wide Line. Failure: 54 (12d8) Acid damage. Success: Half damage.",
            "attack": "Acid Breath||12d8"
          },
          {
            "name": "Slowing Breath",
            "text": "Constitution Saving Throw: DC 18, each creature in a 60-foot Cone. Failure: The target can't take Reactions; its Speed is halved; and it can take either an action or a Bonus Action on its turn, not both. This effect lasts until the end of its next turn."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 17):\n\n\t• At will: Detect Magic, Mind Spike (level 4 version), Minor Illusion, Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell)\n\t• 1/Day each: Greater Restoration, Major Image"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Copper Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Copper Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Giggling Magic",
            "text": "Charisma Saving Throw: DC 17, one creature the dragon can see within 90 feet. Failure: 24 (7d6) Psychic damage. Until the end of its next turn, the target rolls 1d6 whenever it makes an ability check or attack roll and subtracts the number rolled from the D20 Test. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": [
              "Psychic Damage||7d6",
              "Giggling Magic||1d6"
            ]
          },
          {
            "name": "Mind Jolt",
            "text": "The dragon uses Spellcasting to cast Mind Spike (level 4 version). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Copper Dragon Lairs",
            "text": "Copper dragons typically inhabit multichamber caves and renovated ruins.\n\tThe region containing an adult or ancient copper dragon's lair is changed by its presence, creating the following effects:\n\nChatty Critters: Tiny Beasts magically gain the ability to speak and understand Draconic while within 6 miles of the lair.\n\nGiggle Fits: Whenever a creature other than the dragon and its allies is within 1 mile of the lair and rolls a 1 on a D20 Test, it must succeed on a DC 15 Wisdom saving throw or have the Incapacitated condition until the end of its next turn, as it is wracked with laughter.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately.",
            "attack": "Copper Dragon Lairs||1d20"
          }
        ],
        "spells": "Detect Magic [2024], Mind Spike [2024], Minor Illusion [2024], Shapechange [2024], Greater Restoration [2024], Major Image [2024]",
        "description": "Relentlessly friendly and curious, most copper dragons view the world as a place of endless wonder and possibility. These gregarious dragons are fonts of patience, hospitality, and humor, and they seek to improve the lives—or, at least, the mood—of those they interact with. If forced to fight to defend themselves or their friends, these dragons favor using their slowing breath and physical attacks to subdue antagonists. Only in cases of extreme peril or emotion do they use their deadly acid breath.\n\tCopper dragons typically live in caverns amid picturesque hills and rock formations—particularly those that are prominent landmarks. These dragons collect gifts, though they have little interest in treasure without meaning, no matter how valuable it is. To them, thoughtfully given presents and the feelings or memories they symbolize are more important than masterpieces or magical relics.\n\nAdult Copper Dragon:\nAdult copper dragons use their influence to better the world. With broad circles of friends, adult copper dragons delight in introducing people to one another and helping people find places where they can flourish. When disaster strikes, these dragons draw on their family of contacts to offer support, right wrongs, and rebuild stronger than before.\n\nSource:\tMonster Manual 2024 p. 79",
        "environment": "hill"
      },
      {
        "name": "Adult Gold Dragon [2024]",
        "sortname": "Gold Dragon, Adult",
        "ancestry": "Gold Dragon",
        "size": "H",
        "type": "dragon (metallic)",
        "alignment": "lawful good",
        "ac": "19",
        "hp": "243 (18d12+126)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "14",
        "str": "27",
        "dex": "14",
        "con": "25",
        "int": "16",
        "wis": "15",
        "cha": "24",
        "save": "Wis +8, Dex +8",
        "skill": "Persuasion +13, Insight +8, Stealth +8, Perception +14",
        "passive": "24",
        "languages": "Common, Draconic",
        "cr": "17",
        "vulnerable": null,
        "resist": null,
        "immune": "fire",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+6"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Spellcasting to cast Guiding Bolt (level 2 version) or (B) Weakening Breath."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +14, reach 10 ft. Hit: 17 (2d8 + 8) Slashing damage plus 4 (1d8) Fire damage.",
            "attack": [
              "Rend|+14|2d8+8",
              "Fire Damage||1d8"
            ]
          },
          {
            "name": "Fire Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 21, each creature in a 60-foot Cone. Failure: 66 (12d10) Fire damage. Success: Half damage.",
            "attack": "Fire Breath||12d10"
          },
          {
            "name": "Weakening Breath",
            "text": "Strength Saving Throw: DC 21, each creature that isn't currently affected by this breath in a 60-foot Cone. Failure: The target has Disadvantage on Strength-based D20 Tests and subtracts 3 (1d6) from its damage rolls. It repeats the save at the end of each of its turns, ending the effect on itself on a success. After 1 minute, it succeeds automatically.",
            "attack": "Weakening Breath||1d6"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 21, +13 to hit with spell attacks):\n\n\t• At will: Detect Magic, Guiding Bolt (level 2 version), Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell)\n\t• 1/Day each: Flame Strike, Zone of Truth"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Gold Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Gold Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Banish",
            "text": "Charisma Saving Throw: DC 21, one creature the dragon can see within 120 feet. Failure: 10 (3d6) Force damage, and the target has the Incapacitated condition and is transported to a harmless demiplane until the start of the dragon's next turn, at which point it reappears in an unoccupied space of the dragon's choice within 120 feet of the dragon. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Force Damage||3d6"
          },
          {
            "name": "Guiding Light",
            "text": "The dragon uses Spellcasting to cast Guiding Bolt (level 2 version)."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Gold Dragon Lairs",
            "text": "Gold dragons make their homes in places of natural and magical wonder.\n\tThe region containing an adult or ancient gold dragon's lair is altered by its presence, creating the following effects:\n\nDream Messenger: While in its lair, the dragon can cast Dream, requiring no Material components and using Charisma as the spellcasting ability. When casting the spell this way, the dragon can target any creature within 6 miles.\n\nForetelling Fog: The area within 1 mile of the lair is Lightly Obscured by opalescent fog. While in that area, creatures can't be surprised, as the fog swirls into shapes that warn of danger.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Guiding Bolt [2024], Shapechange [2024], Flame Strike [2024], Zone of Truth [2024]",
        "description": "Gold dragons work to make the world a better place. The most powerful of the metallic dragons, these awe-inspiring dragons strive to protect that which is good and bend fate toward a brighter future. Their kind dispositions don't prevent gold dragons from engaging in combat when necessary, though, and they exhale brilliant flames and weakening magic to rout their foes.\n\tGold dragons favor grasslands and pristine forests, frequently dwelling near awe-inspiring natural wonders or guarding monuments from ancient civilizations. In their lairs, gold dragons hoard coins and gems, but they frequently put their treasure to use in pursuit of greater goals. They often use their riches to buy rare lore books, pay informants, or patronize idealistic adventurers.\n\nAdult Gold Dragon:\nAdult gold dragons act subtly, frequently changing their shape to resemble harmless animals or cultivating personas so they can pass as common people.\n\nSource:\tMonster Manual 2024 p. 145",
        "environment": "forest, grassland"
      },
      {
        "name": "Adult Green Dragon [2024]",
        "sortname": "Green Dragon, Adult",
        "ancestry": "Green Dragon",
        "size": "H",
        "type": "dragon (chromatic)",
        "alignment": "lawful evil",
        "ac": "19",
        "hp": "207 (18d12+90)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "11",
        "str": "23",
        "dex": "12",
        "con": "21",
        "int": "18",
        "wis": "15",
        "cha": "18",
        "save": "Wis +7, Dex +6",
        "skill": "Persuasion +9, Deception +9, Stealth +6, Perception +12",
        "passive": "22",
        "languages": "Common, Draconic",
        "cr": "15",
        "vulnerable": null,
        "resist": null,
        "immune": "poison",
        "conditionImmune": "poisoned",
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Mind Spike (level 3 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +11, reach 10 ft. Hit: 15 (2d8 + 6) Slashing damage plus 7 (2d6) Poison damage.",
            "attack": [
              "Rend|+11|2d8+6",
              "Poison Damage||2d6"
            ]
          },
          {
            "name": "Poison Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Constitution Saving Throw: DC 18, each creature in a 60-foot Cone. Failure: 56 (16d6) Poison damage. Success: Half damage.",
            "attack": "Poison Breath||16d6"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 17):\n\n\t• At will: Detect Magic, Mind Spike (level 3 version)\n\t• 1/Day: Geas"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Green Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Green Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Mind Invasion",
            "text": "The dragon uses Spellcasting to cast Mind Spike (level 3 version)."
          },
          {
            "name": "Noxious Miasma",
            "text": "Constitution Saving Throw: DC 17, each creature in a 20-foot-radius Sphere centered on a point the dragon can see within 90 feet. Failure: 7 (2d6) Poison damage, and the target takes a -2 penalty to AC until the end of its next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Noxious Miasma||2d6"
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Green Dragon Lairs",
            "text": "Green dragons lair in ancient forests, often shaping stands of massive trees into compounds of interwoven branches, hollow trunks, and caverns amid mighty roots. They might also dwell amid forested ruins, particularly the former homes of those they've conquered.\n\tThe region containing an adult or ancient green dragon's lair is warped by its presence, creating the following effects:\n\nBeast Spies: Tiny Beasts magically gain the ability to understand Draconic and can communicate telepathically with the dragon while within 1 mile of the lair.\n\nPoisonous Thicket: Ordinary plants growing within 1 mile of the lair poison the air around them.\n\nWhenever a creature other than the dragon or its allies finishes a Long Rest in that area, it must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour.\n\tIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Mind Spike [2024], Geas [2024]",
        "description": "From forbidden forest depths, green dragons whisper evils into the world and manipulate the lives of those who listen. Elusive, conniving, and egotistical, these chromatic dragons patiently prey on the fears of shorter-lived beings, corrupting and isolating them. Green dragons might lurk amid labyrinthine wildernesses for centuries without revealing themselves; even their most devoted followers might know them only as the voice of the woodlands or a whisper in their dreams.\n\tDespite their might, most green dragons disdain physical violence, viewing combat as servants' work and preferring to trick foes into dangerous or exploitative scenarios. These dragons collect \"baubles\" that embody their webs of manipulation and serve as tools of extortion, such as compromising documents, family heirlooms, and sentimental treasures.\n\nAdult Green Dragon:\nThe words of adult green dragons are as deadly as their poisonous breath. They are brilliant schemers that pride themselves on influencing communities near their lairs. They obsess over information and create vast spy networks. Many of these dragons seek magical methods of surveillance or domination, and they manipulate adventurers into hunting down lost magic to aid in such control.\n\nSource:\tMonster Manual 2024 p. 153",
        "environment": "forest"
      },
      {
        "name": "Adult Red Dragon [2024]",
        "sortname": "Red Dragon, Adult",
        "ancestry": "Red Dragon",
        "size": "H",
        "type": "dragon (chromatic)",
        "alignment": "chaotic evil",
        "ac": "19",
        "hp": "256 (19d12+133)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "init": "12",
        "str": "27",
        "dex": "10",
        "con": "25",
        "int": "16",
        "wis": "13",
        "cha": "23",
        "save": "Wis +7, Dex +6",
        "skill": "Stealth +6, Perception +13",
        "passive": "23",
        "languages": "Common, Draconic",
        "cr": "17",
        "vulnerable": null,
        "resist": null,
        "immune": "fire",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+6"
          },
          {
            "name": "Treasure",
            "text": "Any: The monster's treasure hoard can include monetary treasure and any kinds of magic items."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Scorching Ray."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +14, reach 10 ft. Hit: 13 (1d10 + 8) Slashing damage plus 5 (2d4) Fire damage.",
            "attack": [
              "Rend|+14|1d10+8",
              "Fire Damage||2d4"
            ]
          },
          {
            "name": "Fire Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 21, each creature in a 60-foot Cone. Failure: 59 (17d6) Fire damage. Success: Half damage.",
            "attack": "Fire Breath||17d6"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 20, +12 to hit with spell attacks):\n\n\t• At will: Command (level 2 version), Detect Magic, Scorching Ray\n\t• 1/Day: Fireball"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Red Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Red Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Commanding Presence",
            "text": "The dragon uses Spellcasting to cast Command (level 2 version). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Fiery Rays",
            "text": "The dragon uses Spellcasting to cast Scorching Ray. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Red Dragon Lairs",
            "text": "Red dragons make their lairs in smoldering, unapproachable places such as volcanic mountains, burning wastelands, and ruins they've stolen from other creatures.\n\tThe region containing an adult or ancient red dragon's lair is warped by its presence, creating the following effects:\n\nBurning Heat: The area within 1 mile of the lair is an area of extreme heat. A burning creature or object takes an additional 1d4 Fire damage at the start of each of its turns.\n\nSmoldering Haze: The area within 1 mile of the lair is Lightly Obscured with clouds of ash. Whenever a creature other than the dragon or one of its allies finishes a Long Rest in that area, that creature must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately.",
            "attack": "Burning Heat||1d4"
          }
        ],
        "spells": "Command [2024], Detect Magic [2024], Scorching Ray [2024], Fireball [2024]",
        "description": "Red dragons take whatever they desire and burn to ash anything that stands in their way. These chromatic dragons endlessly desire more—more magic, territory, treasure, or whatever else inflames their cruel ambitions.\n\tRed dragons make their lairs amid perilous cliffs and volcanoes. Within, they amass and fiercely protect hoards of treasure, and many have perfect recall of the hoards' contents and the locations of all they've collected. Should anything go missing, red dragons fly into rages. They don't rest until their treasures are returned and the thieves have burned.\n\tRed dragons believe themselves to be the greatest of all dragons and, by extension, the greatest of all creatures. To them, pillaging and conquering are their right—treasures can find no more honored place than in their hoards, and other creatures are privileged to serve them.\n\nAdult Red Dragon:\nAdult red dragons are tyrants that claim vast domains and might command armies of followers or significant magical resources. Red dragons rarely pay attention to the nations and claims of smaller creatures, and they might consider entire cities part of their realm. Most red dragons are inattentive rulers, though, spending decades focused on their own comforts, hoards, or magical concerns within their lairs. But when their attention returns to their territories, if they find matters not to their liking, whole lands might burn.\n\nSource:\tMonster Manual 2024 p. 255",
        "environment": "hill, mountain"
      },
      {
        "name": "Adult Silver Dragon [2024]",
        "sortname": "Silver Dragon, Adult",
        "ancestry": "Silver Dragon",
        "size": "H",
        "type": "dragon (metallic)",
        "alignment": "lawful good",
        "ac": "19",
        "hp": "216 (16d12+112)",
        "speed": "40 ft., fly 80 ft.",
        "init": "10",
        "str": "27",
        "dex": "10",
        "con": "25",
        "int": "16",
        "wis": "13",
        "cha": "22",
        "save": "Wis +6, Dex +5",
        "skill": "Stealth +5, History +8, Perception +11",
        "passive": "21",
        "languages": "Common, Draconic",
        "cr": "16",
        "vulnerable": null,
        "resist": null,
        "immune": "cold",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Paralyzing Breath or (B) Spellcasting to cast Ice Knife."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +13, reach 10 ft. Hit: 17 (2d8 + 8) Slashing damage plus 4 (1d8) Cold damage.",
            "attack": [
              "Rend|+13|2d8+8",
              "Cold Damage||1d8"
            ]
          },
          {
            "name": "Cold Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Constitution Saving Throw: DC 20, each creature in a 60-foot Cone. Failure: 54 (12d8) Cold damage. Success: Half damage.",
            "attack": "Cold Breath||12d8"
          },
          {
            "name": "Paralyzing Breath",
            "text": "Constitution Saving Throw: DC 20, each creature in a 60-foot Cone. First Failure: The target has the Incapacitated condition until the end of its next turn, when it repeats the save. Second Failure: The target has the Paralyzed condition, and it repeats the save at the end of each of its turns, ending the effect on itself on a success. After 1 minute, it succeeds automatically."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 19, +11 to hit with spell attacks):\n\n\t• At will: Detect Magic, Hold Monster, Ice Knife, Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell)\n\t• 1/Day each: Ice Storm (level 5 version), Zone of Truth"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult Silver Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult Silver Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Chill",
            "text": "The dragon uses Spellcasting to cast Hold Monster. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Cold Gale",
            "text": "Dexterity Saving Throw: DC 19, each creature in a 60-foot-long, 10-foot-wide Line. Failure: 14 (4d6) Cold damage, and the target is pushed up to 30 feet straight away from the dragon. Success: Half damage only. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Cold Gale||4d6"
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Silver Dragon Lairs",
            "text": "Silver dragons typically lair in picturesque mountain retreats or on sculpted cloud \"islands.\"\n\tThe region containing an adult or ancient silver dragon's lair is changed by its magic, creating the following effects:\n\nGentle Gusts: Winds buoy creatures that fall within 1 mile of the lair. Such creatures descend at a rate of 60 feet per round and take no damage from falling.\n\nSun and Storms: While in its lair, the dragon can cast Control Weather, requiring no Material components and using the same spellcasting ability as its Spellcasting action.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Hold Monster [2024], Ice Knife [2024], Shapechange [2024], Ice Storm [2024], Zone of Truth [2024], Control Weather [2024]",
        "description": "Silver dragons work to preserve peace and encourage greatness. They try to live as examples of decency while remaining watchful against evil.\n\tSilver dragons typically dwell amid snow-capped mountains, though aspirations and congeniality drive some to instead live among cosmopolitan societies. Disguised as humanoids, they ally with artists, historians, knights, and humble leaders who learn from the past to create better futures.\n\tSilver dragons take inspiration from legendary heroes and have grand ambitions. Many collect treasures that reflect these interests, such as histories, ancient art, and the gear of famous champions.\n\nAdult Silver Dragon:\nAdult silver dragons love to spend time among various peoples. Rather than manipulating politics directly, they support individuals who have ambitious goals or who popularize the return of great universities, inspiring athletics events or festivals, and other salutary civic institutions of the past. Silver dragons often surround themselves with like-minded allies and are watchful for hidden threats.\n\nSource:\tMonster Manual 2024 p. 279",
        "environment": "mountain, urban"
      },
      {
        "name": "Adult White Dragon [2024]",
        "sortname": "White Dragon, Adult",
        "ancestry": "White Dragon",
        "size": "H",
        "type": "dragon (chromatic)",
        "alignment": "chaotic evil",
        "ac": "18",
        "hp": "200 (16d12+96)",
        "speed": "40 ft., fly 80 ft., burrow 30 ft., swim 40 ft.",
        "init": "10",
        "str": "22",
        "dex": "10",
        "con": "22",
        "int": "8",
        "wis": "12",
        "cha": "12",
        "save": "Wis +6, Dex +5",
        "skill": "Stealth +5, Perception +11",
        "passive": "21",
        "languages": "Common, Draconic",
        "cr": "13",
        "vulnerable": null,
        "resist": null,
        "immune": "cold",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+5"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Ice Walk",
            "text": "The dragon can move across and climb icy surfaces without needing to make an ability check. Additionally, Difficult Terrain composed of ice or snow doesn't cost it extra movement."
          },
          {
            "name": "Legendary Resistance (3/Day, or 4/Day in Lair)",
            "recharge": "4/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +11, reach 10 ft. Hit: 13 (2d6 + 6) Slashing damage plus 4 (1d8) Cold damage.",
            "attack": [
              "Rend|+11|2d6+6",
              "Cold Damage||1d8"
            ]
          },
          {
            "name": "Cold Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Constitution Saving Throw: DC 19, each creature in a 60-foot Cone. Failure: 54 (12d8) Cold damage. Success: Half damage.",
            "attack": "Cold Breath||12d8"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Adult White Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Adult White Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Freezing Burst",
            "text": "Constitution Saving Throw: DC 14, each creature in a 30-foot-radius Sphere centered on a point the dragon can see within 120 feet. Failure: 7 (2d6) Cold damage, and the target's Speed is 0 until the end of the target's next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Freezing Burst||2d6"
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "name": "Frightful Presence",
            "text": "The dragon casts Fear, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 14). The dragon can't take this action again until the start of its next turn."
          },
          {
            "@category": "lair",
            "name": "White Dragon Lairs",
            "text": "White dragons brood in bitterly cold lairs clawed from stone and ice.\n\tThe region containing an adult or ancient white dragon's lair is affected by its presence, creating the following effects:\n\nFrigid Cold: The area within 1 mile of the lair is an area of extreme cold. Any water in that area is frigid water. See the Dungeon Master' s Guide for rules on extreme cold and frigid water.\n\nGlacial Gloom: The area within 1 mile of the lair is Lightly Obscured by chilly fog. Whenever a creature other than the dragon or one of its allies finishes a Long Rest in that area, that creature must succeed on a DC 15 Constitution saving throw or have its Speed reduced by 10 feet for 1 hour.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "description": "Among the most primal chromatic dragons, white dragons prioritize survival over all. Life is harsh and uncertain in the arctic expanses, glacial heights, and frozen seas where these dragons dwell. White dragons fiercely protect their territories, scouring the frigid regions for food and evidence of trespassers. Most white dragons ignore the plots of smaller creatures and other dragons, concerning themselves only with their own survival.\n\tWhite dragons create lairs to defend themselves from other deadly arctic creatures and from dangerous natural conditions. Within these shelters, white dragons hoard testaments to their superiority, such as monstrous skulls, the gear of defeated rivals, and curiosities that capture their interest. To protect such treasure, white dragons coax ice to form over their hoards or sink their wealth in frigid pools. For white dragons, each piece of treasure embodies a victory—the details of which inflate as these dragons age.\n\nAdult White Dragon:\nAdult white dragons claim large territories and are often the mightiest predators in those lands. While some lurk in their lairs for months, others regularly soar over their domains. When they spot something moving on the ice, they might swoop down to feed or extort food and offerings from sapient creatures.\n\nSource:\tMonster Manual 2024 p. 329",
        "environment": "arctic"
      },
      {
        "name": "Air Elemental [2024]",
        "size": "L",
        "type": "elemental",
        "alignment": "neutral",
        "ac": "15",
        "hp": "90 (12d10+24)",
        "speed": "10 ft., fly 90 ft.(hover)",
        "init": "5",
        "str": "14",
        "dex": "20",
        "con": "14",
        "int": "6",
        "wis": "10",
        "cha": "6",
        "save": null,
        "skill": null,
        "passive": "10",
        "languages": "Primordial (Auran)",
        "cr": "5",
        "vulnerable": null,
        "resist": "bludgeoning, lightning, piercing, slashing",
        "immune": "poison, thunder",
        "conditionImmune": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
        "senses": "darkvision 60 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+3"
          },
          {
            "name": "Air Form",
            "text": "The elemental can enter a creature's space and stop there. It can move through a space as narrow as 1 inch without expending extra movement to do so."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The elemental makes two Thunderous Slam attacks."
          },
          {
            "name": "Thunderous Slam",
            "text": "Melee Attack Roll: +8, reach 10 ft. Hit: 14 (2d8 + 5) Thunder damage.",
            "attack": "Thunderous Slam|+8|2d8+5"
          },
          {
            "name": "Whirlwind (Recharge 4-6)",
            "recharge": "D4",
            "text": "Strength Saving Throw: DC 13, one Medium or smaller creature in the elemental's space. Failure: 24 (4d10 + 2) Thunder damage, and the target is pushed up to 20 feet straight away from the elemental and has the Prone condition. Success: Half damage only.",
            "attack": "Whirlwind||4d10+2"
          }
        ],
        "description": "Energetic spirits from the Elemental Plane of Air, air elementals gather clouds and winds into ever-changing bodies with indistinct limbs and vague features. Beyond their home plane, these elementals might serve magic-users who conjure them, or they might congregate around nexuses of unbridled planar energy, such as wind-scoured mountain peaks or endless storms. In battle, air elementals batter enemies with powerful gusts or transform into whirlwinds to fling away foes.\n\tAir elementals often have distinctive compositions. Roll on or choose a result from the Air Elemental Compositions table to inspire the elemental's appearance.\n\nAir Elemental Compositions:\n1d6 | The Air Elemental's Body Features...\n1 | Cumulus or cirrus clouds.\n2 | A mixture of vibrantly colored gases.\n3 | A pungent, sour-looking miasma.\n4 | Shifting cloud clusters that resemble animals and simple shapes.\n5 | Sinister features obscured in a misty mass.\n6 | Swirling storm clouds.\n\nSource:\tMonster Manual 2024 p. 13",
        "environment": "desert, mountain, planar (elemental plane of air)"
      },
      {
        "name": "Allosaurus [2024]",
        "size": "L",
        "type": "beast (dinosaur)",
        "alignment": "unaligned",
        "ac": "13",
        "hp": "51 (6d10+18)",
        "speed": "60 ft.",
        "init": "1",
        "str": "19",
        "dex": "13",
        "con": "17",
        "int": "2",
        "wis": "12",
        "cha": "5",
        "save": null,
        "skill": "Perception +5",
        "passive": "15",
        "languages": null,
        "cr": "2",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": [
          {
            "name": "Bite",
            "text": "Melee Attack Roll: +6, reach 5 ft. Hit: 15 (2d10 + 4) Piercing damage.",
            "attack": "Bite|+6|2d10+4"
          },
          {
            "name": "Claws",
            "text": "Melee Attack Roll: +6, reach 5 ft. Hit: 8 (1d8 + 4) Slashing damage. If the target is a Large or smaller creature and the allosaurus moved 30+ feet straight toward it immediately before the hit, the target has the Prone condition, and the allosaurus can make one Bite attack against it.",
            "attack": "Claws|+6|1d8+4"
          }
        ],
        "description": "Source:\tMonster Manual 2024 p. 348",
        "environment": "grassland"
      },
      {
        "name": "Ancient Black Dragon [2024]",
        "sortname": "Black Dragon, Ancient",
        "ancestry": "Black Dragon",
        "size": "G",
        "type": "dragon (chromatic)",
        "alignment": "chaotic evil",
        "ac": "22",
        "hp": "367 (21d20+147)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "16",
        "str": "27",
        "dex": "14",
        "con": "25",
        "int": "16",
        "wis": "15",
        "cha": "22",
        "save": "Wis +9, Dex +9",
        "skill": "Stealth +9, Perception +16",
        "passive": "26",
        "languages": "Common, Draconic",
        "cr": "21",
        "vulnerable": null,
        "resist": null,
        "immune": "acid",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Relics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Melf's Acid Arrow (level 4 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +15, reach 15 ft. Hit: 17 (2d8 + 8) Slashing damage plus 9 (2d8) Acid damage.",
            "attack": [
              "Rend|+15|2d8+8",
              "Acid Damage||2d8"
            ]
          },
          {
            "name": "Acid Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 22, each creature in a 90-foot-long, 10-foot-wide Line. Failure: 67 (15d8) Acid damage. Success: Half damage.",
            "attack": "Acid Breath||15d8"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 21, +13 to hit with spell attacks):\n\n\t• At will: Detect Magic, Fear, Melf's Acid Arrow (level 4 version)\n\t• 1/Day each: Create Undead, Speak with Dead, Vitriolic Sphere (level 5 version)"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Black Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Black Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Cloud of Insects",
            "text": "Dexterity Saving Throw: DC 21, one creature the dragon can see within 120 feet. Failure: 33 (6d10) Poison damage, and the target has Disadvantage on saving throws to maintain Concentration until the end of its next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Cloud of Insects||6d10"
          },
          {
            "name": "Frightful Presence",
            "text": "The dragon uses Spellcasting to cast Fear. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Black Dragon Lairs",
            "text": "Black dragons lurk in dismal ruins, polluted bogs, or other sites gripped by decay.\n\tThe region containing an adult or ancient black dragon's lair is warped by its presence, creating the following effects:\n\nAcrid Haze: Odorous and stifling fog covers the area within 1 mile of the lair, rendering that area Lightly Obscured. Travel for creatures other than the dragon and its allies takes twice the usual time in that area.\n\nFoul Water: Water sources within 1 mile of the lair are supernaturally fouled. A creature that drinks such water must succeed on a DC 15 Constitution saving throw or have the Poisoned condition for 1 hour.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Fear [2024], Melf's Acid Arrow [2024], Create Undead [2024], Speak With Dead [2024], Vitriolic Sphere [2024]",
        "description": "Black dragons delight in suffering and ruin. While other chromatic dragons scheme for power and wealth, these dragons seek to tear down all they see and rule over what remains.\n\tBlack dragons are terrifying creatures with curved horns and withered visages suggestive of fiendish skulls. They typically inhabit stagnant swamps, crumbling ruins, or places of magical or environmental corruption. Their acid breath scars their domains, eroding the features from ancient statues and leaving nature with festering wounds.\n\tBlack dragons hoard tarnished symbols of hope and relics of fallen empires. The more sought-after the treasure, the more black dragons prize it—particularly if they were responsible for it being lost.\n\n\tAncient black dragons plot the ruin of whole realms. They seek magic to corrupt the land, raise undead hordes, bind fiends, and replicate magical disasters. Ancient black dragons strive to create vast, dead domains where they are the greatest things that remain.\n\nSource:\tMonster Manual 2024 p. 40",
        "environment": "swamp"
      },
      {
        "name": "Ancient Blue Dragon [2024]",
        "sortname": "Blue Dragon, Ancient",
        "ancestry": "Blue Dragon",
        "size": "G",
        "type": "dragon (chromatic)",
        "alignment": "lawful evil",
        "ac": "22",
        "hp": "481 (26d20+208)",
        "speed": "40 ft., fly 80 ft., burrow 40 ft.",
        "init": "14",
        "str": "29",
        "dex": "10",
        "con": "27",
        "int": "18",
        "wis": "17",
        "cha": "25",
        "save": "Wis +10, Dex +7",
        "skill": "Stealth +7, Perception +17",
        "passive": "27",
        "languages": "Common, Draconic",
        "cr": "23",
        "vulnerable": null,
        "resist": null,
        "immune": "lightning",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Relics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Shatter (level 3 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +16, reach 15 ft. Hit: 18 (2d8 + 9) Slashing damage plus 11 (2d10) Lightning damage.",
            "attack": [
              "Rend|+16|2d8+9",
              "Lightning Damage||2d10"
            ]
          },
          {
            "name": "Lightning Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 23, each creature in a 120-foot-long, 10-foot-wide Line. Failure: 88 (16d10) Lightning damage. Success: Half damage.",
            "attack": "Lightning Breath||16d10"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 22):\n\n\t• At will: Detect Magic, Invisibility, Mage Hand, Shatter (level 3 version)\n\t• 1/Day each: Scrying, Sending"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Blue Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Blue Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Cloaked Flight",
            "text": "The dragon uses Spellcasting to cast Invisibility on itself, and it can fly up to half its Fly Speed. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Sonic Boom",
            "text": "The dragon uses Spellcasting to cast Shatter (level 3 version). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Tail Swipe",
            "text": "The dragon makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Blue Dragon Lairs",
            "text": "Blue dragons dwell in arid lands. Their lairs might be death traps meant to entomb invaders or ostentatious fortresses where they plot domination.\n\tThe region containing an adult or ancient blue dragon's lair is changed by its presence, creating the following effects:\n\nSinkholes: Sinkholes form more frequently in the area within 1 mile of the lair. Whenever a creature in that area other than the dragon and its allies finishes a Long Rest, roll 1d20. On a 1, a sinkhole opens beneath the creature, and the creature must succeed on a DC 15 Dexterity saving throw or fall 2d4 × 10 feet into the sinkhole.\n\nSpiteful Storms: Dust devils and thunderstorms rage within 1 mile of the lair. The area is Lightly Obscured.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Invisibility [2024], Mage Hand [2024], Shatter [2024], Scrying [2024], Sending [2024]",
        "description": "Arrogant and imperious, blue dragons are chromatic dragons that crave control and collect followers like other dragons hoard treasure. They seek to transform their territories into empires, domains to be feared by nations.\n\tBlue dragons have sharp features with piercing horns and scales that range from sapphire to the shades of stormy skies. They dwell in deserts and badlands, particularly regions with dramatic spires from whose tops they might see for miles. They seek lairs near sites of symbolic power, such as the abandoned fortresses of giants, the colossi of fallen empires, or monuments raised by their followers.\n\tRegalia of rulership and artistic masterpieces fill blue dragons' hoards. These dragons have no interest in treasures that are common or flawed, preferring one-of-a-kind gemstones, the crowns of fallen royals, and magic items capable of spreading the dragons' influence.\n\nAncient blue dragons think beyond dominating groups of short-lived servants. Instead, they seek to claim their places above other dragons and their world's most powerful inhabitants. If world domination seems too tedious or cliché, these dragons might seek to seize control of extraplanar realms, multiworld empires, or forces of reality—like life, storms, or time itself.\n\nSource:\tMonster Manual 2024 p. 50",
        "environment": "coastal, desert"
      },
      {
        "name": "Ancient Brass Dragon [2024]",
        "sortname": "Brass Dragon, Ancient",
        "ancestry": "Brass Dragon",
        "size": "G",
        "type": "dragon (metallic)",
        "alignment": "chaotic good",
        "ac": "20",
        "hp": "332 (19d20+133)",
        "speed": "40 ft., fly 80 ft., burrow 40 ft.",
        "init": "12",
        "str": "27",
        "dex": "10",
        "con": "25",
        "int": "16",
        "wis": "15",
        "cha": "22",
        "save": "Wis +8, Dex +6",
        "skill": "Persuasion +12, Stealth +6, History +9, Perception +14",
        "passive": "24",
        "languages": "Common, Draconic",
        "cr": "20",
        "vulnerable": null,
        "resist": null,
        "immune": "fire",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+6"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Sleep Breath or (B) Spellcasting to cast Scorching Ray (level 3 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +14, reach 15 ft. Hit: 19 (2d10 + 8) Slashing damage plus 7 (2d6) Fire damage.",
            "attack": [
              "Rend|+14|2d10+8",
              "Fire Damage||2d6"
            ]
          },
          {
            "name": "Fire Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 21, each creature in a 90-foot-long, 5-foot-wide Line. Failure: 58 (13d8) Fire damage. Success: Half damage.",
            "attack": "Fire Breath||13d8"
          },
          {
            "name": "Sleep Breath",
            "text": "Constitution Saving Throw: DC 21, each creature in a 90-foot Cone. Failure: The target has the Incapacitated condition until the end of its next turn, at which point it repeats the save. Second Failure: The target has the Unconscious condition for 10 minutes. This effect ends for the target if it takes damage or a creature within 5 feet of it takes an action to wake it."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 20):\n\n\t• At will: Detect Magic, Minor Illusion, Scorching Ray (level 3 version), Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell), Speak with Animals\n\t• 1/Day each: Control Weather, Detect Thoughts"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Brass Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Brass Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Blazing Light",
            "text": "The dragon uses Spellcasting to cast Scorching Ray (level 3 version)."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "name": "Scorching Sands",
            "text": "Dexterity Saving Throw: DC 20, one creature the dragon can see within 120 feet. Failure: 36 (8d8) Fire damage, and the target's Speed is halved until the end of its next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Scorching Sands||8d8"
          },
          {
            "@category": "lair",
            "name": "Brass Dragon Lairs",
            "text": "Brass dragons usually dwell in secret caves and canyons near well-traveled routes.\n\tThe area containing an adult or ancient brass dragon's lair is altered by its presence, creating the following effects:\n\nMirages: While in its lair, the dragon can cast Major Image , requiring no Material components and using the same spellcasting ability as its Spellcasting action. When casting the spell this way, the spell's range is 1 mile, and the dragon doesn't need to see the spot where the illusion appears.\n\nRefreshing Water: Water within 1 mile of the lair is magically refreshing. A creature that drinks such water gains 2d4 Temporary Hit Points, and the dragon is immediately aware of the creature's presence.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Minor Illusion [2024], Scorching Ray [2024], Shapechange [2024], Speak With Animals [2024], Control Weather [2024], Detect Thoughts [2024]",
        "description": "Gregarious and outgoing, brass dragons relish sharing knowledge and stories. Although these metallic dragons favor arid lands, they cheerfully journey considerable distances to visit friendly creatures, pass on what they've learned, and collect news. Though good natured, brass dragons don't shirk from combat when necessary, thwarting foes with magical sleep and searing them with flame.\n\tBrass dragons favor warm climes, particularly steppes and rocky or sandy deserts, and they usually dwell near prominent crossroads or oases that regularly draw visitors. They enjoy adopting Humanoid forms, disguising themselves as traveling merchants, scholars, storytellers, or anyone else invested in others' stories.\n\tBrass dragons collect eclectic objects. While such items might seem like knickknacks, each is part of a story—perhaps a nostalgic memento or evidence of a tale passed into myth. An old friend's hat and the crown of the last ruler of a forgotten dynasty could occupy the same shelf in a brass dragon's hoard.\n\nAncient brass dragons create worlds-spanning networks. They combat forces of repression and misinformation, helping people learn from the mistakes of the past. Either personally or through webs of messengers, ancient brass dragons keep allies informed about challenges they can face together.\n\nSource:\tMonster Manual 2024 p. 56",
        "environment": "desert"
      },
      {
        "name": "Ancient Bronze Dragon [2024]",
        "sortname": "Bronze Dragon, Ancient",
        "ancestry": "Bronze Dragon",
        "size": "G",
        "type": "dragon (metallic)",
        "alignment": "lawful good",
        "ac": "22",
        "hp": "444 (24d20+192)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "14",
        "str": "29",
        "dex": "10",
        "con": "27",
        "int": "18",
        "wis": "17",
        "cha": "25",
        "save": "Wis +10, Dex +7",
        "skill": "Insight +10, Stealth +7, Perception +17",
        "passive": "27",
        "languages": "Common, Draconic",
        "cr": "22",
        "vulnerable": null,
        "resist": null,
        "immune": "lightning",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Implements: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Repulsion Breath or (B) Spellcasting to cast Guiding Bolt (level 2 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +16, reach 15 ft. Hit: 18 (2d8 + 9) Slashing damage plus 9 (2d8) Lightning damage.",
            "attack": [
              "Rend|+16|2d8+9",
              "Lightning Damage||2d8"
            ]
          },
          {
            "name": "Lightning Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 23, each creature in a 120-foot-long, 10-foot-wide Line. Failure: 82 (15d10) Lightning damage. Success: Half damage.",
            "attack": "Lightning Breath||15d10"
          },
          {
            "name": "Repulsion Breath",
            "text": "Strength Saving Throw: DC 23, each creature in a 30-foot Cone. Failure: The target is pushed up to 60 feet straight away from the dragon and has the Prone condition."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 22, +14 to hit with spell attacks):\n\n\t• At will: Detect Magic, Guiding Bolt (level 2 version), Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell), Speak with Animals, Thaumaturgy\n\t• 1/Day each: Detect Thoughts, Control Water, Scrying, Water Breathing"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Bronze Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Bronze Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Guiding Light",
            "text": "The dragon uses Spellcasting to cast Guiding Bolt (level 2 version)."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "name": "Thunderclap",
            "text": "Constitution Saving Throw: DC 22, each creature in a 20-foot-radius Sphere centered on a point the dragon can see within 120 feet. Failure: 13 (3d8) Thunder damage, and the target has the Deafened condition until the end of its next turn.",
            "attack": "Thunderclap||3d8"
          },
          {
            "@category": "lair",
            "name": "Bronze Dragon Lairs",
            "text": "Bronze dragons usually make their homes near or under the sea.\n\tThe region containing an adult or ancient bronze dragon's lair is changed by its presence, creating the following effects:\n\nBuoying Currents: Creatures within 1 mile of the lair that lack a Swim Speed ignore the extra cost of movement while swimming.\n\nSun and Storms: While in its lair, the dragon can cast Contr ol W eather , requiring no Material components and using the same spellcasting ability as its Spellcasting action. When casting the spell this way, the dragon can control the weather within 1 mile of its lair, regardless if the dragon is inside or outside.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Guiding Bolt [2024], Shapechange [2024], Speak With Animals [2024], Thaumaturgy [2024], Detect Thoughts [2024], Control Water [2024], Scrying [2024], Water Breathing [2024]",
        "description": "Where bronze dragons dwell, wonders flourish. Imaginative yet mindful, these metallic dragons work toward greatness and help others achieve all they can. They strive to preserve innovations, from the works of past civilizations to new discoveries, and they share such works widely. When dealing with shorter-lived beings, bronze dragons prefer to win them over through conversation and cultivation, but they don't shy from battle when villains keep others from achieving their potential.\n\tBronze dragons enjoy the power and endless possibilities of the sea, and they often make their lairs in places of natural beauty or communities they wish to preserve. Within their dwellings, bronze dragons hoard things they believe will be useful one day. They salvage treasure lost to the sea, reclaiming wealth or sunken ships.\n\nAncient bronze dragons develop dramatic patinas on their glimmering scales. These dragons strive to protect whole regions, continents, or planets from threats. They seek solutions to planes-spanning calamities or multiversal perils and oppose the evil of mighty chromatic dragons\n\nSource:\tMonster Manual 2024 p. 60",
        "environment": "coastal"
      },
      {
        "name": "Ancient Copper Dragon [2024]",
        "sortname": "Copper Dragon, Ancient",
        "ancestry": "Copper Dragon",
        "size": "G",
        "type": "dragon (metallic)",
        "alignment": "chaotic good",
        "ac": "21",
        "hp": "367 (21d20+147)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "init": "15",
        "str": "27",
        "dex": "12",
        "con": "25",
        "int": "20",
        "wis": "17",
        "cha": "22",
        "save": "Wis +10, Dex +8",
        "skill": "Deception +13, Stealth +8, Perception +17",
        "passive": "27",
        "languages": "Common, Draconic",
        "cr": "21",
        "vulnerable": null,
        "resist": null,
        "immune": "acid",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Slowing Breath or (B) Spellcasting to cast Mind Spike (level 5 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +15, reach 15 ft. Hit: 19 (2d10 + 8) Slashing damage plus 9 (2d8) Acid damage.",
            "attack": [
              "Rend|+15|2d10+8",
              "Acid Damage||2d8"
            ]
          },
          {
            "name": "Acid Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 22, each creature in an 90-foot-long, 10-foot-wide Line. Failure: 63 (14d8) Acid damage. Success: Half damage.",
            "attack": "Acid Breath||14d8"
          },
          {
            "name": "Slowing Breath",
            "text": "Constitution Saving Throw: DC 22, each creature in a 90-foot Cone. Failure: The target can't take Reactions; its Speed is halved; and it can take either an action or a Bonus Action on its turn, not both. This effect lasts until the end of its next turn."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 21):\n\n\t• At will: Detect Magic, Mind Spike (level 5 version), Minor Illusion, Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell)\n\t• 1/Day each: Greater Restoration, Major Image, Project Image"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Copper Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Copper Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Giggling Magic",
            "text": "Charisma Saving Throw: DC 21, one creature the dragon can see within 120 feet. Failure: 31 (9d6) Psychic damage. Until the end of its next turn, the target rolls 1d8 whenever it makes an ability check or attack roll and subtracts the number rolled from the D20 Test. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": [
              "Psychic Damage||9d6",
              "Giggling Magic||1d8"
            ]
          },
          {
            "name": "Mind Jolt",
            "text": "The dragon uses Spellcasting to cast Mind Spike (level 5 version). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Copper Dragon Lairs",
            "text": "Copper dragons typically inhabit multichamber caves and renovated ruins.\n\tThe region containing an adult or ancient copper dragon's lair is changed by its presence, creating the following effects:\n\nChatty Critters: Tiny Beasts magically gain the ability to speak and understand Draconic while within 6 miles of the lair.\n\nGiggle Fits: Whenever a creature other than the dragon and its allies is within 1 mile of the lair and rolls a 1 on a D20 Test, it must succeed on a DC 15 Wisdom saving throw or have the Incapacitated condition until the end of its next turn, as it is wracked with laughter.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Mind Spike [2024], Minor Illusion [2024], Shapechange [2024], Greater Restoration [2024], Major Image [2024], Project Image [2024]",
        "description": "Relentlessly friendly and curious, most copper dragons view the world as a place of endless wonder and possibility. These gregarious dragons are fonts of patience, hospitality, and humor, and they seek to improve the lives—or, at least, the mood—of those they interact with. If forced to fight to defend themselves or their friends, these dragons favor using their slowing breath and physical attacks to subdue antagonists. Only in cases of extreme peril or emotion do they use their deadly acid breath.\n\tCopper dragons typically live in caverns amid picturesque hills and rock formations—particularly those that are prominent landmarks. These dragons collect gifts, though they have little interest in treasure without meaning, no matter how valuable it is. To them, thoughtfully given presents and the feelings or memories they symbolize are more important than masterpieces or magical relics.\n\nAncient copper dragons use warmth and reliability to effect change over time. They open their cozy lairs to their friends as havens of learning and laughter for the young and those in need. These dragons watch for and oppose future threats while fostering sanctuaries of simple goodness.\n\nSource:\tMonster Manual 2024 p. 80",
        "environment": "hill"
      },
      {
        "name": "Ancient Gold Dragon [2024]",
        "sortname": "Gold Dragon, Ancient",
        "ancestry": "Gold Dragon",
        "size": "G",
        "type": "dragon (metallic)",
        "alignment": "lawful good",
        "ac": "22",
        "hp": "546 (28d20+252)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "16",
        "str": "30",
        "dex": "14",
        "con": "29",
        "int": "18",
        "wis": "17",
        "cha": "28",
        "save": "Wis +10, Dex +9",
        "skill": "Persuasion +16, Insight +10, Stealth +9, Perception +17",
        "passive": "27",
        "languages": "Common, Draconic",
        "cr": "24",
        "vulnerable": null,
        "resist": null,
        "immune": "fire",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Spellcasting to cast Guiding Bolt (level 4 version) or (B) Weakening Breath."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +17 to hit, reach 15 ft. Hit: 19 (2d8 + 10) Slashing damage plus 9 (2d8) Fire damage.",
            "attack": [
              "Rend|+17|2d8+10",
              "Fire Damage||2d8"
            ]
          },
          {
            "name": "Fire Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 24, each creature in a 90-foot Cone. Failure: 71 (13d10) Fire damage. Success: Half damage.",
            "attack": "Fire Breath||13d10"
          },
          {
            "name": "Weakening Breath",
            "text": "Strength Saving Throw: DC 24, each creature that isn't currently affected by this breath in a 90-foot Cone. Failure: The target has Disadvantage on Strength-based D20 Tests and subtracts 5 (1d10) from its damage rolls. It repeats the save at the end of each of its turns, ending the effect on itself on a success. After 1 minute, it succeeds automatically.",
            "attack": "Weakening Breath||1d10"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 24, +16 to hit with spell attacks):\n\n\t• At will: Detect Magic, Guiding Bolt (level 4 version), Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell)\n\t• 1/Day each: Flame Strike (level 6 version), Word of Recall, Zone of Truth"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Gold Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Gold Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Banish",
            "text": "Charisma Saving Throw: DC 24, one creature the dragon can see within 120 feet. Failure: 24 (7d6) Force damage, and the target has the Incapacitated condition and is transported to a harmless demiplane until the start of the dragon's next turn, at which point it reappears in an unoccupied space of the dragon's choice within 120 feet of the dragon. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Banish||7d6"
          },
          {
            "name": "Guiding Light",
            "text": "The dragon uses Spellcasting to cast Guiding Bolt (level 4 version)."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Gold Dragon Lairs",
            "text": "Gold dragons make their homes in places of natural and magical wonder.\n\tThe region containing an adult or ancient gold dragon's lair is altered by its presence, creating the following effects:\n\nDream Messenger: While in its lair, the dragon can cast Dream, requiring no Material components and using Charisma as the spellcasting ability. When casting the spell this way, the dragon can target any creature within 6 miles.\n\nForetelling Fog: The area within 1 mile of the lair is Lightly Obscured by opalescent fog. While in that area, creatures can't be surprised, as the fog swirls into shapes that warn of danger.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Guiding Bolt [2024], Shapechange [2024], Flame Strike [2024], Word of Recall [2024], Zone of Truth [2024]",
        "description": "Gold dragons work to make the world a better place. The most powerful of the metallic dragons, these awe-inspiring dragons strive to protect that which is good and bend fate toward a brighter future. Their kind dispositions don't prevent gold dragons from engaging in combat when necessary, though, and they exhale brilliant flames and weakening magic to rout their foes.\n\tGold dragons favor grasslands and pristine forests, frequently dwelling near awe-inspiring natural wonders or guarding monuments from ancient civilizations. In their lairs, gold dragons hoard coins and gems, but they frequently put their treasure to use in pursuit of greater goals. They often use their riches to buy rare lore books, pay informants, or patronize idealistic adventurers.\n\nAncient Gold Dragon:\nAncient gold dragons are wise and mysterious. Many aid virtuous groups, guiding them in secret or patronizing them from afar. Only when stakes are at their highest do ancient gold dragons reveal themselves in all their majesty.\n\nSource:\tMonster Manual 2024 p. 146",
        "environment": "forest, grassland"
      },
      {
        "name": "Ancient Green Dragon [2024]",
        "sortname": "Green Dragon, Ancient",
        "ancestry": "Green Dragon",
        "size": "G",
        "type": "dragon (chromatic)",
        "alignment": "lawful evil",
        "ac": "21",
        "hp": "402 (23d20+161)",
        "speed": "40 ft., fly 80 ft., swim 40 ft.",
        "init": "15",
        "str": "27",
        "dex": "12",
        "con": "25",
        "int": "20",
        "wis": "17",
        "cha": "22",
        "save": "Wis +10, Dex +8",
        "skill": "Persuasion +13, Deception +13, Stealth +8, Perception +17",
        "passive": "27",
        "languages": "Common, Draconic",
        "cr": "22",
        "vulnerable": null,
        "resist": null,
        "immune": "poison",
        "conditionImmune": "poisoned",
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Amphibious",
            "text": "The dragon can breathe air and water."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Mind Spike (level 5 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +15, reach 15 ft. Hit: 17 (2d8 + 8) Slashing damage plus 10 (3d6) Poison damage.",
            "attack": [
              "Rend|+15|2d8+8",
              "Poison Damage||3d6"
            ]
          },
          {
            "name": "Poison Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Constitution Saving Throw: DC 22, each creature in a 90-foot Cone. Failure: 77 (22d6) Poison damage. Success: Half damage.",
            "attack": "Poison Breath||22d6"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 21):\n\n\t• At will: Detect Magic, Mind Spike (level 5 version)\n\t• 1/Day each: Geas, Modify Memory"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Green Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Green Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Mind Invasion",
            "text": "The dragon uses Spellcasting to cast Mind Spike (level 5 version)."
          },
          {
            "name": "Noxious Miasma",
            "text": "Constitution Saving Throw: DC 21, each creature in a 30-foot-radius Sphere centered on a point the dragon can see within 90 feet. Failure: 17 (5d6) Poison damage, and the target takes a -2 penalty to AC until the end of its next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Noxious Miasma||5d6"
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          }
        ],
        "spells": "Detect Magic [2024], Mind Spike [2024], Geas [2024], Modify Memory [2024]",
        "description": "From forbidden forest depths, green dragons whisper evils into the world and manipulate the lives of those who listen. Elusive, conniving, and egotistical, these chromatic dragons patiently prey on the fears of shorter-lived beings, corrupting and isolating them. Green dragons might lurk amid labyrinthine wildernesses for centuries without revealing themselves; even their most devoted followers might know them only as the voice of the woodlands or a whisper in their dreams.\n\tDespite their might, most green dragons disdain physical violence, viewing combat as servants' work and preferring to trick foes into dangerous or exploitative scenarios. These dragons collect \"baubles\" that embody their webs of manipulation and serve as tools of extortion, such as compromising documents, family heirlooms, and sentimental treasures.\n\nAncient Green Dragon:\nAncient green dragons are creatures of legend, rarely seen by their servants or foes. Via magic and well-hidden agents, these dragons stoke suspicion between allies and undermine noble works. As bonds fray, the dragons reap rewards of greater wealth and control. Eventually the ambitions of ancient green dragons stretch beyond their territories as they seek control over empires, planar realms, or death itself.\n\nSource:\tMonster Manual 2024 p. 154",
        "environment": "forest"
      },
      {
        "name": "Ancient Red Dragon [2024]",
        "sortname": "Red Dragon, Ancient",
        "ancestry": "Red Dragon",
        "size": "G",
        "type": "dragon (chromatic)",
        "alignment": "chaotic evil",
        "ac": "22",
        "hp": "507 (26d20+234)",
        "speed": "40 ft., climb 40 ft., fly 80 ft.",
        "init": "14",
        "str": "30",
        "dex": "10",
        "con": "29",
        "int": "18",
        "wis": "15",
        "cha": "27",
        "save": "Wis +9, Dex +7",
        "skill": "Stealth +7, Perception +16",
        "passive": "26",
        "languages": "Common, Draconic",
        "cr": "24",
        "vulnerable": null,
        "resist": null,
        "immune": "fire",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Any: The monster's treasure hoard can include monetary treasure and any kinds of magic items."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of Spellcasting to cast Scorching Ray (level 3 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +17, reach 15 ft. Hit: 19 (2d8 + 10) Slashing damage plus 10 (3d6) Fire damage.",
            "attack": [
              "Rend|+17|2d8+10",
              "Fire Damage||3d6"
            ]
          },
          {
            "name": "Fire Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Dexterity Saving Throw: DC 24, each creature in a 90-foot Cone. Failure: 91 (26d6) Fire damage. Success: Half damage.",
            "attack": "Fire Breath||26d6"
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 23, +15 to hit with spell attacks):\n\n\t• At will: Command (level 2 version), Detect Magic, Scorching Ray (level 3 version)\n\t• 1/Day each: Fireball (level 6 version), Scrying"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Red Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Red Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Commanding Presence",
            "text": "The dragon uses Spellcasting to cast Command (level 2 version). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Fiery Rays",
            "text": "The dragon uses Spellcasting to cast Scorching Ray (level 3 version). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          }
        ],
        "spells": "Command [2024], Detect Magic [2024], Scorching Ray [2024], Fireball [2024], Scrying [2024]",
        "description": "Red dragons take whatever they desire and burn to ash anything that stands in their way. These chromatic dragons endlessly desire more—more magic, territory, treasure, or whatever else inflames their cruel ambitions.\n\tRed dragons make their lairs amid perilous cliffs and volcanoes. Within, they amass and fiercely protect hoards of treasure, and many have perfect recall of the hoards' contents and the locations of all they've collected. Should anything go missing, red dragons fly into rages. They don't rest until their treasures are returned and the thieves have burned.\n\tRed dragons believe themselves to be the greatest of all dragons and, by extension, the greatest of all creatures. To them, pillaging and conquering are their right—treasures can find no more honored place than in their hoards, and other creatures are privileged to serve them.\n\nAncient Red Dragon:\nAncient red dragons number among the most feared and destructive beings in the multiverse. Few can withstand the wrath of an ancient red dragon that turns its mind toward devastation. These dragons' greed matches their ruinous potential, and they collect vast hoards studded with storied treasures and magic items. Their lairs frequently tap into volcanic depths and might pierce other planes of existence, bringing servants from the Elemental Plane of Fire or the Lower Planes into their service.\n\nSource:\tMonster Manual 2024 p. 256",
        "environment": "hill, mountain"
      },
      {
        "name": "Ancient Silver Dragon [2024]",
        "sortname": "Silver Dragon, Ancient",
        "ancestry": "Silver Dragon",
        "size": "G",
        "type": "dragon (metallic)",
        "alignment": "lawful good",
        "ac": "22",
        "hp": "468 (24d20+216)",
        "speed": "40 ft., fly 80 ft.",
        "init": "14",
        "str": "30",
        "dex": "10",
        "con": "29",
        "int": "18",
        "wis": "15",
        "cha": "26",
        "save": "Wis +9, Dex +7",
        "skill": "Stealth +7, History +11, Perception +16",
        "passive": "26",
        "languages": "Common, Draconic",
        "cr": "23",
        "vulnerable": null,
        "resist": null,
        "immune": "cold",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (4/Day, or 5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks. It can replace one attack with a use of (A) Paralyzing Breath or (B) Spellcasting to cast Ice Knife (level 2 version)."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +17, reach 15 ft. Hit: 19 (2d8 + 10) Slashing damage plus 9 (2d8) Cold damage.",
            "attack": [
              "Rend|+17|2d8+10",
              "Cold Damage||2d8"
            ]
          },
          {
            "name": "Cold Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Constitution Saving Throw: DC 24, each creature in a 90-foot Cone. Failure: 67 (15d8) Cold damage. Success: Half damage.",
            "attack": "Cold Breath||15d8"
          },
          {
            "name": "Paralyzing Breath",
            "text": "Constitution Saving Throw: DC 24, each creature in a 90-foot Cone. First Failure: The target has the Incapacitated condition until the end of its next turn, when it repeats the save. Second Failure: The target has the Paralyzed condition, and it repeats the save at the end of each of its turns, ending the effect on itself on a success. After 1 minute, it succeeds automatically."
          },
          {
            "name": "Spellcasting",
            "text": "The dragon casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 23, +15 to hit with spell attacks):\n\n\t• At will: Detect Magic, Hold Monster, Ice Knife (level 2 version), Shapechange (Beast or Humanoid form only,  no Temporary Hit Points gained from the spell,  and no Concentration or Temporary Hit Points required to maintain the spell)\n\t• 1/Day each: Control Weather, Ice Storm (level 7 version), Teleport, Zone of Truth"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient Silver Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient Silver Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Chill",
            "text": "The dragon uses Spellcasting to cast Hold Monster. The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Cold Gale",
            "text": "Dexterity Saving Throw: DC 23, each creature in a 60-foot-long, 10-foot-wide Line. Failure: 14 (4d6) Cold damage, and the target is pushed up to 30 feet straight away from the dragon. Success: Half damage only. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Cold Gale||4d6"
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "Silver Dragon Lairs",
            "text": "Silver dragons typically lair in picturesque mountain retreats or on sculpted cloud \"islands.\"\n\tThe region containing an adult or ancient silver dragon's lair is changed by its magic, creating the following effects:\n\nGentle Gusts: Winds buoy creatures that fall within 1 mile of the lair. Such creatures descend at a rate of 60 feet per round and take no damage from falling.\n\nSun and Storms: While in its lair, the dragon can cast Control Weather, requiring no Material components and using the same spellcasting ability as its Spellcasting action.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Magic [2024], Hold Monster [2024], Ice Knife [2024], Shapechange [2024], Control Weather [2024], Ice Storm [2024], Teleport [2024], Zone of Truth [2024]",
        "description": "Silver dragons work to preserve peace and encourage greatness. They try to live as examples of decency while remaining watchful against evil.\n\tSilver dragons typically dwell amid snow-capped mountains, though aspirations and congeniality drive some to instead live among cosmopolitan societies. Disguised as humanoids, they ally with artists, historians, knights, and humble leaders who learn from the past to create better futures.\n\tSilver dragons take inspiration from legendary heroes and have grand ambitions. Many collect treasures that reflect these interests, such as histories, ancient art, and the gear of famous champions.\n\nAncient Silver Dragon:\nAncient silver dragons pursue world-wide change. They defend their communities and allies, encouraging them to perform deeds worthy of legend. Some set their sights on other worlds and planes of existence, creating extraplanar alliances or combating multiplanar threats. They might have guises in multiple societies and forge generation-spanning friendships with heroic families or valorous groups.\n\nSource:\tMonster Manual 2024 p. 280",
        "environment": "mountain, urban"
      },
      {
        "name": "Ancient White Dragon [2024]",
        "sortname": "White Dragon, Ancient",
        "ancestry": "White Dragon",
        "size": "G",
        "type": "dragon (chromatic)",
        "alignment": "chaotic evil",
        "ac": "20",
        "hp": "333 (18d20+144)",
        "speed": "40 ft., fly 80 ft., burrow 40 ft., swim 40 ft.",
        "init": "12",
        "str": "26",
        "dex": "10",
        "con": "26",
        "int": "10",
        "wis": "13",
        "cha": "18",
        "save": "Wis +7, Dex +6",
        "skill": "Stealth +6, Perception +13",
        "passive": "23",
        "languages": "Common, Draconic",
        "cr": "20",
        "vulnerable": null,
        "resist": null,
        "immune": "cold",
        "conditionImmune": null,
        "senses": "blindsight 60 ft., darkvision 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+6"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Ice Walk",
            "text": "The dragon can move across and climb icy surfaces without needing to make an ability check. Additionally, Difficult Terrain composed of ice or snow doesn't cost it extra movement."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the dragon fails a saving throw, it can choose to succeed instead."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The dragon makes three Rend attacks."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +14, reach 15 ft. Hit: 17 (2d8 + 8) Slashing damage plus 7 (2d6) Cold damage.",
            "attack": [
              "Rend|+14|2d8+8",
              "Cold Damage||2d6"
            ]
          },
          {
            "name": "Cold Breath (Recharge 5-6)",
            "recharge": "D5",
            "text": "Constitution Saving Throw: DC 22, each creature in a 90-foot Cone. Failure: 63 (14d8) Cold damage. Success: Half damage.",
            "attack": "Cold Breath||14d8"
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Ancient White Dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Ancient White Dragon regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Freezing Burst",
            "text": "Constitution Saving Throw: DC 20, each creature in a 30-foot-radius Sphere centered on a point the dragon can see within 120 feet. Failure: 14 (4d6) Cold damage, and the target's Speed is 0 until the end of the target's next turn. Failure or Success: The dragon can't take this action again until the start of its next turn.",
            "attack": "Freezing Burst||4d6"
          },
          {
            "name": "Frightful Presence",
            "text": "The dragon casts Fear, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 18). The dragon can't take this action again until the start of its next turn."
          },
          {
            "name": "Pounce",
            "text": "The dragon moves up to half its Speed, and it makes one Rend attack."
          },
          {
            "@category": "lair",
            "name": "White Dragon Lairs",
            "text": "White dragons brood in bitterly cold lairs clawed from stone and ice.\n\tThe region containing an adult or ancient white dragon's lair is affected by its presence, creating the following effects:\n\nFrigid Cold: The area within 1 mile of the lair is an area of extreme cold. Any water in that area is frigid water. See the Dungeon Master' s Guide for rules on extreme cold and frigid water.\n\nGlacial Gloom: The area within 1 mile of the lair is Lightly Obscured by chilly fog. Whenever a creature other than the dragon or one of its allies finishes a Long Rest in that area, that creature must succeed on a DC 15 Constitution saving throw or have its Speed reduced by 10 feet for 1 hour.\n\nIf the dragon dies or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "description": "Among the most primal chromatic dragons, white dragons prioritize survival over all. Life is harsh and uncertain in the arctic expanses, glacial heights, and frozen seas where these dragons dwell. White dragons fiercely protect their territories, scouring the frigid regions for food and evidence of trespassers. Most white dragons ignore the plots of smaller creatures and other dragons, concerning themselves only with their own survival.\n\tWhite dragons create lairs to defend themselves from other deadly arctic creatures and from dangerous natural conditions. Within these shelters, white dragons hoard testaments to their superiority, such as monstrous skulls, the gear of defeated rivals, and curiosities that capture their interest. To protect such treasure, white dragons coax ice to form over their hoards or sink their wealth in frigid pools. For white dragons, each piece of treasure embodies a victory—the details of which inflate as these dragons age.\n\nAncient White Dragon:\nLike arctic storms, ancient white dragons threaten icy realms. They emerge from their frozen lairs to indulge their hungers for food or treasure, menacing other creatures with lethal cold. While they might ignore animals or small groups of polar wanderers, these dragons are quick to challenge other dragons and creatures wielding powerful magic, hoping to add their foes' skulls and magic items to their own hoards.\n\nSource:\tMonster Manual 2024 p. 330",
        "environment": "arctic"
      },
      {
        "name": "Animal Lord [2024]",
        "size": "M",
        "type": "celestial",
        "alignment": "neutral",
        "ac": "19",
        "hp": "323 (34d8+170)",
        "speed": "60 ft., fly 60 ft.(hover), swim 60 ft.",
        "init": "19",
        "str": "24",
        "dex": "25",
        "con": "20",
        "int": "19",
        "wis": "23",
        "cha": "22",
        "save": "Wis +12, Con +11",
        "skill": "Stealth +13, Athletics +13, Acrobatics +13, Perception +18",
        "passive": "28",
        "languages": "all",
        "cr": "20",
        "vulnerable": null,
        "resist": "cold, fire, necrotic, psychic, radiant",
        "immune": null,
        "conditionImmune": "charmed, frightened, stunned",
        "senses": "truesight 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+6"
          },
          {
            "name": "Treasure",
            "text": "Relics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Animal Lordship",
            "text": "An animal lord represents a Forager, Hunter, or Sage (DM's choice), which determines certain traits in this stat block."
          },
          {
            "name": "Legendary Resistance (4/Day)",
            "recharge": "4/DAY",
            "text": "If the animal lord fails a saving throw, it can choose to succeed instead."
          },
          {
            "name": "Lordly Presence",
            "text": "Wisdom Saving Throw: DC 20, any enemy that starts its turn in a 30-foot Emanation originating from the animal lord. Failure: The target suffers one of the following effects:\n\nCaptivated (Forager Only): The target has the Charmed condition until the end of its next turn. While Charmed, the target has the Incapacitated condition.\n\nFearful (Hunter Only): The target has the Frightened condition until the end of its next turn.\n\nMired (Sage Only): The target takes 10 (3d6) Psychic damage, and the target is magically bewildered until the end of its next turn. While bewildered, the target subtracts 1d4 from its saving throws.",
            "attack": [
              "Psychic Damage||3d6",
              "Mired||1d4"
            ]
          },
          {
            "name": "Magic Resistance",
            "text": "The animal lord has Advantage on saving throws against spells and other magical effects."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The animal lord makes two attacks, using Rend or Radiant Ray in any combination, and uses Animal Spirit."
          },
          {
            "name": "Rend",
            "text": "Melee Attack Roll: +13, reach 5 ft. Hit: 14 (2d6 + 7) Slashing damage plus 7 (2d6) Force damage.",
            "attack": [
              "Rend|+13|2d6+7",
              "Force Damage||2d6"
            ]
          },
          {
            "name": "Radiant Ray",
            "text": "Ranged Attack Roll: +12, range 120 ft. Hit: 20 (4d6 + 6) Radiant damage.",
            "attack": "Radiant Ray|+12|4d6+6"
          },
          {
            "name": "Animal Spirit",
            "text": "The animal lord conjures an animal spirit that strikes at a creature and then disappears. Dexterity Saving Throw: DC 20, one creature the animal lord can see within 120 feet. Failure: 28 (4d10 + 6) Radiant damage. Success: Half damage. Failure or Success: One of the following effects occurs:\n\nFortify (Forager Only): The animal lord gains 20 Temporary Hit Points.\n\nMarked as Prey (Hunter Only): The animal lord has Advantage on attack rolls against the target until the start of the animal lord's next turn.\n\nPesky Swarm (Sage Only): The target has Disadvantage on attack rolls and ability checks until the end of its next turn.",
            "attack": "Radiant Damage||4d10+6"
          },
          {
            "name": "Spellcasting",
            "text": "The animal lord casts one of the following spells, requiring no Material components and using Wisdom as the spellcasting ability (spell save DC 20):\n\n\t• At will: Animal Friendship, Animal Messenger, Speak with Animals\n\t• 2/Day each: Awaken, Greater Restoration\n\t• 1/Day each: Animal Shapes, Sunburst"
          },
          {
            "name": "Shape-Shift (Bonus Action)",
            "text": "The animal lord shape-shifts into a Huge or smaller version of the animal it represents or a Medium or Small Humanoid, or it returns to its true form. Its game statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying isn't transformed."
          }
        ],
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Animal Lord can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Animal Lord regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Feral Strike",
            "text": "The animal lord moves up to its Speed without provoking Opportunity Attacks, and it makes one Rend attack."
          },
          {
            "name": "Radiant Strike",
            "text": "The animal lord makes one Radiant Ray attack."
          }
        ],
        "spells": "Animal Friendship [2024], Animal Messenger [2024], Speak With Animals [2024], Awaken [2024], Greater Restoration [2024], Animal Shapes [2024], Sunburst [2024]",
        "description": "Animal lords are the immortal spirits of legendary animals. They serve as the divine protectors of animals of their kind, and they appear as hybrids of humanoids and the animals they defend. They frequently change into giant, idealized versions of the animals they're associated with—albeit with glowing eyes. When contending with people, they sometimes appear as humanlike beings with subtle, animal-like features. No matter their appearance, animal lords exhibit the instincts and predilections of the animals they represent, tempered by their intellect and experience.\n\tMost animal lords make their homes in the Beastlands, but they occasionally journey to the Feywild or other idyllic realms. They rarely travel to the Material Plane, making exceptions only when a world faces environmental disaster or droves of animals are otherwise in jeopardy.\nAmong the best-known animal lords are those that represent cats, hawks, lizards, and wolves, but animal lords exist for beasts of all types. Some animal lords even embody creatures that are rare or extinct on Material Plane worlds, like megafauna or dinosaurs. Using their divine might, animal lords can summon spectral animals, channel spiritual energy, and exhibit powers associated with one of three broad groups: foragers, hunters, or sages. These powers are tied to an animal lord's personality and traits associated with the creature it resembles. Roll on or choose results from the relevant Animal Lord Appearances table to inspire what creature an animal lord resembles.\n\nForager Animal Lord Appearances:\n1d10 | Bestial Shape\n1 | Bear\n2 | Bee\n3 | Bison\n4 | Capybara\n5 | Carp\n6 | Rabbit\n7 | Rooster\n8 | Sloth\n9 | Stag\n10 | Vulture\n\nHunter Animal Lord Appearances:\n1d10 | Bestial Shape\n1 | Alligator\n2 | Badger\n3 | Bat\n4 | Cat\n5 | Hawk\n6 | Mongoose\n7 | Praying mantis\n8 | Shark\n9 | Snake\n10 | Wolf\n\nSage Animal Lord Appearances:\n1d10 | Bestial Shape\n1 | Coyote\n2 | Crow\n3 | Elephant\n4 | Lizard\n5 | Mouse\n6 | Owl\n7 | Salmon\n8 | Spider\n9 | Turtle\n10 | Whale\n\nSource:\tMonster Manual 2024 p. 15",
        "environment": "planar (beastlands)"
      },
      {
        "name": "Animated Armor [2024]",
        "sortname": "Animated Objects, Armor",
        "ancestry": "Animated Objects",
        "size": "M",
        "type": "construct",
        "alignment": "unaligned",
        "ac": "18",
        "hp": "33 (6d8+6)",
        "speed": "25 ft.",
        "init": "2",
        "str": "14",
        "dex": "11",
        "con": "13",
        "int": "1",
        "wis": "3",
        "cha": "1",
        "save": null,
        "skill": null,
        "passive": "6",
        "languages": null,
        "cr": "1",
        "vulnerable": null,
        "resist": null,
        "immune": "poison, psychic",
        "conditionImmune": "charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned",
        "senses": "blindsight 60 ft.",
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": [
          {
            "name": "Multiattack",
            "text": "The armor makes two Slam attacks."
          },
          {
            "name": "Slam",
            "text": "Melee Attack Roll: +4, reach 5 ft. Hit: 5 (1d6 + 2) Bludgeoning damage.",
            "attack": "Slam|+4|1d6+2"
          }
        ],
        "description": "Magic can manipulate mundane items, compelling them to perform simple tasks. Such animate objects might be unassuming tools or decorations that can defend their creator. These objects follow simple instructions from whatever force or magic-user created them. If left unattended, they might defend an area for ages or repeat a task until they wear out.\n\tRoll on or choose a result from the Animated Object Catalysts table to inspire what sort of magic motivates an ambulatory item.\n\nAnimated Object Catalysts:\n1d10 | The Object Was Animated By...\n1 |  A Celestial or Fiend using the object to protect or torment a mortal.\n2 | A combination of magic and technology, such as alchemy or alien science.\n3 | The essence of someone transformed by a supernatural trickster.\n4 | Fey as part of their games or wiles.\n5 | Happenstance, with the item gaining a semblance of life after a hundred years of use.\n6 | A magic-user in need of a guardian or servant.\n7 | The song of a magical instrument.\n8 | A spirit possessing the object.\n9 | Wild magic, a spell that went awry, or a chaotic Artifact.\n10 | The will of a powerful psychic being.\n\nAnimated suits of armor might move with steady deliberateness or awkward gaits. They're often constructed from plate armor, making them easy to mistake for soldiers or helmed horrors. Other types of armor or even metal statuary might also become animated armor.\n\nSource:\tMonster Manual 2024 p. 16",
        "environment": "urban"
      },
      {
        "name": "Animated Broom [2024]",
        "sortname": "Animated Objects, Broom",
        "ancestry": "Animated Objects",
        "size": "S",
        "type": "construct",
        "alignment": "unaligned",
        "ac": "15",
        "hp": "14 (4d6)",
        "speed": "5 ft., fly 50 ft.(hover)",
        "init": "5",
        "str": "10",
        "dex": "17",
        "con": "10",
        "int": "1",
        "wis": "5",
        "cha": "1",
        "save": null,
        "skill": null,
        "passive": "7",
        "languages": null,
        "cr": "1/4",
        "vulnerable": null,
        "resist": null,
        "immune": "poison, psychic",
        "conditionImmune": "charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned",
        "senses": "blindsight 60 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+2"
          },
          {
            "name": "Flyby",
            "text": "The broom doesn't provoke an Opportunity Attack when it flies out of an enemy's reach."
          }
        ],
        "action": {
          "name": "Slam",
          "text": "Melee Attack Roll: +5, reach 5 ft. Hit: 5 (1d4 + 3) Bludgeoning damage.",
          "attack": "Slam|+5|1d4+3"
        },
        "description": "Magic can manipulate mundane items, compelling them to perform simple tasks. Such animate objects might be unassuming tools or decorations that can defend their creator. These objects follow simple instructions from whatever force or magic-user created them. If left unattended, they might defend an area for ages or repeat a task until they wear out.\n\tRoll on or choose a result from the Animated Object Catalysts table to inspire what sort of magic motivates an ambulatory item.\n\nAnimated Object Catalysts:\n1d10 | The Object Was Animated By...\n1 |  A Celestial or Fiend using the object to protect or torment a mortal.\n2 | A combination of magic and technology, such as alchemy or alien science.\n3 | The essence of someone transformed by a supernatural trickster.\n4 | Fey as part of their games or wiles.\n5 | Happenstance, with the item gaining a semblance of life after a hundred years of use.\n6 | A magic-user in need of a guardian or servant.\n7 | The song of a magical instrument.\n8 | A spirit possessing the object.\n9 | Wild magic, a spell that went awry, or a chaotic Artifact.\n10 | The will of a powerful psychic being.\n\nAnimated brooms keep their surroundings tidy and defend them when necessary. Launching into the air, these brooms dart about, attacking foes from unexpected angles. Other flying objects, like animated tools or staffs, might also use this stat block.\n\nSource:\tMonster Manual 2024 p. 16",
        "environment": "urban"
      },
      {
        "name": "Animated Flying Sword [2024]",
        "sortname": "Animated Objects, Flying Sword",
        "ancestry": "Animated Objects",
        "size": "S",
        "type": "construct",
        "alignment": "unaligned",
        "ac": "17",
        "hp": "14 (4d6)",
        "speed": "5 ft., fly 50 ft.(hover)",
        "init": "4",
        "str": "12",
        "dex": "15",
        "con": "11",
        "int": "1",
        "wis": "5",
        "cha": "1",
        "save": "Dex +4",
        "skill": null,
        "passive": "7",
        "languages": null,
        "cr": "1/4",
        "vulnerable": null,
        "resist": null,
        "immune": "poison, psychic",
        "conditionImmune": "charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned",
        "senses": "blindsight 60 ft.",
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": {
          "name": "Slash",
          "text": "Melee Attack Roll: +4, reach 5 ft. Hit: 6 (1d8 + 2) Slashing damage.",
          "attack": "Slash|+4|1d8+2"
        },
        "description": "Magic can manipulate mundane items, compelling them to perform simple tasks. Such animate objects might be unassuming tools or decorations that can defend their creator. These objects follow simple instructions from whatever force or magic-user created them. If left unattended, they might defend an area for ages or repeat a task until they wear out.\n\tRoll on or choose a result from the Animated Object Catalysts table to inspire what sort of magic motivates an ambulatory item.\n\nAnimated Object Catalysts:\n1d10 | The Object Was Animated By...\n1 |  A Celestial or Fiend using the object to protect or torment a mortal.\n2 | A combination of magic and technology, such as alchemy or alien science.\n3 | The essence of someone transformed by a supernatural trickster.\n4 | Fey as part of their games or wiles.\n5 | Happenstance, with the item gaining a semblance of life after a hundred years of use.\n6 | A magic-user in need of a guardian or servant.\n7 | The song of a magical instrument.\n8 | A spirit possessing the object.\n9 | Wild magic, a spell that went awry, or a chaotic Artifact.\n10 | The will of a powerful psychic being.\n\nAnimated flying swords move as if wielded by unseen warriors. Whether an animated blade is newly forged or a constellation of broken fragments, the object behaves the same. Other weapons from the Pla y er' s Handbook can also be animated and use game statistics similar to those here.\n\nSource:\tMonster Manual 2024 p. 17",
        "environment": "urban"
      },
      {
        "name": "Animated Rug of Smothering [2024]",
        "sortname": "Animated Objects, Rug of Smothering",
        "ancestry": "Animated Objects",
        "size": "L",
        "type": "construct",
        "alignment": "unaligned",
        "ac": "12",
        "hp": "27 (5d10)",
        "speed": "10 ft.",
        "init": "4",
        "str": "17",
        "dex": "14",
        "con": "10",
        "int": "1",
        "wis": "3",
        "cha": "1",
        "save": null,
        "skill": null,
        "passive": "6",
        "languages": null,
        "cr": "2",
        "vulnerable": null,
        "resist": null,
        "immune": "poison, psychic",
        "conditionImmune": "charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned",
        "senses": "blindsight 60 ft.",
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": {
          "name": "Smother",
          "text": "Melee Attack Roll: +5, reach 5 ft. Hit: 10 (2d6 + 3) Bludgeoning damage. If the target is a Medium or smaller creature, the rug can give it the Grappled condition (escape DC 13) instead of dealing damage. Until the grapple ends, the target has the Blinded and Restrained conditions, is suffocating, and takes 10 (2d6 + 3) Bludgeoning damage at the start of each of its turns. The rug can smother only one creature at a time.\n\tWhile grappling the target, the rug can't take this action, the rug halves the damage it takes (round down), and the target takes the same amount of damage.",
          "attack": "Smother|+5|2d6+3"
        },
        "description": "Magic can manipulate mundane items, compelling them to perform simple tasks. Such animate objects might be unassuming tools or decorations that can defend their creator. These objects follow simple instructions from whatever force or magic-user created them. If left unattended, they might defend an area for ages or repeat a task until they wear out.\n\tRoll on or choose a result from the Animated Object Catalysts table to inspire what sort of magic motivates an ambulatory item.\n\nAnimated Object Catalysts:\n1d10 | The Object Was Animated By...\n1 |  A Celestial or Fiend using the object to protect or torment a mortal.\n2 | A combination of magic and technology, such as alchemy or alien science.\n3 | The essence of someone transformed by a supernatural trickster.\n4 | Fey as part of their games or wiles.\n5 | Happenstance, with the item gaining a semblance of life after a hundred years of use.\n6 | A magic-user in need of a guardian or servant.\n7 | The song of a magical instrument.\n8 | A spirit possessing the object.\n9 | Wild magic, a spell that went awry, or a chaotic Artifact.\n10 | The will of a powerful psychic being.\n\nAnimated rugs of smothering might attack any creature that steps on them, or they might be passed off as superficially similar magic items, such as Carpets of Flying , and attack those who speak a supposed command word. Deadly tapestries, furs, and similar items also use this stat block.\n\nSource:\tMonster Manual 2024 p. 17",
        "environment": "urban"
      },
      {
        "name": "Ankheg [2024]",
        "size": "L",
        "type": "monstrosity",
        "alignment": "unaligned",
        "ac": "14",
        "hp": "45 (6d10+12)",
        "speed": "30 ft., burrow 10 ft.",
        "init": "0",
        "str": "17",
        "dex": "11",
        "con": "14",
        "int": "1",
        "wis": "13",
        "cha": "6",
        "save": null,
        "skill": null,
        "passive": "11",
        "languages": null,
        "cr": "2",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": "darkvision 60 ft., tremorsense 60 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+2"
          },
          {
            "name": "Tunneler",
            "text": "The ankheg can burrow through solid rock at half its Burrow Speed and leaves a 10-foot-diameter tunnel in its wake."
          }
        ],
        "action": [
          {
            "name": "Bite",
            "text": "Melee Attack Roll: +5 (with Advantage if the target is Grappled by the ankheg), reach 5 ft. Hit: 10 (2d6 + 3) Slashing damage plus 3 (1d6) Acid damage. If the target is a Large or smaller creature, it has the Grappled condition (escape DC 13).",
            "attack": [
              "Bite|+5|2d6+3",
              "Acid Damage||1d6"
            ]
          },
          {
            "name": "Acid Spray (Recharge 6)",
            "recharge": "D6",
            "text": "Dexterity Saving Throw: DC 12, each creature in a 30-foot-long, 5-foot-wide Line. Failure: 14 (4d6) Acid damage. Success: Half damage.",
            "attack": "Acid Spray||4d6"
          }
        ],
        "description": "Oversize insects, ankhegs burrow close to the surface, creating sprawling underground labyrinths. From these tunnels, they burst forth to dissolve and devour smaller creatures using their acid-dripping mandibles and sprays of digestive enzymes.\n\tAnkhegs are the bane of farmers whose grazing livestock are easy prey for these monsters. Many ankhegs hunt alone, but those in places with ample food might collect in nests of several dozen and threaten whole towns. Ankheg nests can be challenging to wipe out unless the monsters' tunnels are cleared out and their eggs destroyed.\n\tAnkheg tunnels are roughly cylindrical and are often littered with the remains of ankhegs' meals and subterranean treasures. Roll on or choose a result from the Ankheg Tunnel Discoveries table to inspire what might be found in an ankheg's tunnel.\n\nAnkheg Tunnel Discoveries:\n1d8 | Inside the Ankheg Tunnel Is...\n1 | Another tunnel (either natural or of worked stone) that extends into the Underdark.\n2 | A buried ruin or grave exposed by the tunnel.\n3 | A cluster of 1d4 fresh ankheg eggs that can be broken and used as vials of Acid.\n4 | A dead ankheg and evidence of a deadlier subterranean predator.\n5 | A piece of ankheg carapace usable as a Shield.\n6 | A pouch with 2d6 GP near a puddle of acid.\n7 | A stray farm or woodland animal.\n8 | A viciously mauled scarecrow.\n\nSource:\tMonster Manual 2024 p. 18",
        "environment": "forest, grassland"
      },
      {
        "name": "Ankylosaurus [2024]",
        "size": "H",
        "type": "beast (dinosaur)",
        "alignment": "unaligned",
        "ac": "15",
        "hp": "68 (8d12+16)",
        "speed": "30 ft.",
        "init": "0",
        "str": "19",
        "dex": "11",
        "con": "15",
        "int": "2",
        "wis": "12",
        "cha": "5",
        "save": "Str +6",
        "skill": null,
        "passive": "11",
        "languages": null,
        "cr": "3",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": [
          {
            "name": "Multiattack",
            "text": "The ankylosaurus makes two Tail attacks."
          },
          {
            "name": "Tail",
            "text": "Melee Attack Roll: +6, reach 10 ft. Hit: 9 (1d10 + 4) Bludgeoning damage. If the target is a Huge or smaller creature, it has the Prone condition.",
            "attack": "Tail|+6|1d10+4"
          }
        ],
        "description": "Source:\tMonster Manual 2024 p. 348",
        "environment": "grassland"
      },
      {
        "name": "Ape [2024]",
        "sortname": "Ape",
        "ancestry": "Ape",
        "size": "M",
        "type": "beast",
        "alignment": "unaligned",
        "ac": "12",
        "hp": "19 (3d8+6)",
        "speed": "30 ft., climb 30 ft.",
        "init": "2",
        "str": "16",
        "dex": "14",
        "con": "14",
        "int": "6",
        "wis": "12",
        "cha": "7",
        "save": null,
        "skill": "Athletics +5, Perception +3",
        "passive": "13",
        "languages": null,
        "cr": "1/2",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": [
          {
            "name": "Multiattack",
            "text": "The ape makes two Fist attacks."
          },
          {
            "name": "Fist",
            "text": "Melee Attack Roll: +5, reach 5 ft. Hit: 5 (1d4 + 3) Bludgeoning damage.",
            "attack": "Fist|+5|1d4+3"
          },
          {
            "name": "Rock (Recharge 6)",
            "text": "Ranged Attack Roll: +5, range 25/50 ft. Hit: 10 (2d6 + 3) Bludgeoning damage.",
            "recharge": "D6",
            "attack": "Rock|+5|2d6+3"
          }
        ],
        "description": "Source:\tMonster Manual 2024 p. 348,\n\t\tPlayer's Handbook 2024 p. 346",
        "environment": "forest"
      },
      {
        "name": "Arcanaloth [2024]",
        "size": "M",
        "type": "fiend (yugoloth)",
        "alignment": "neutral evil",
        "ac": "18",
        "hp": "175 (27d8+54)",
        "speed": "30 ft., fly 30 ft.(hover)",
        "init": "5",
        "str": "17",
        "dex": "12",
        "con": "14",
        "int": "20",
        "wis": "16",
        "cha": "18",
        "save": "Wis +7, Con +6, Dex +5, Int +9",
        "skill": "Insight +7, Deception +7, Arcana +9, Perception +7",
        "passive": "17",
        "languages": "all; telepathy 120 ft.",
        "cr": "12",
        "vulnerable": null,
        "resist": "cold, fire, lightning",
        "immune": "acid, poison",
        "conditionImmune": "charmed, poisoned",
        "senses": "truesight 120 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+4"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Fiendish Restoration",
            "text": "If the arcanaloth dies outside Gehenna, its body dissolves into ichor, and it gains a new body instantly and revives with all its Hit Points in Gehenna."
          },
          {
            "name": "Magic Resistance",
            "text": "The arcanaloth has Advantage on saving throws against spells and other magical effects."
          },
          {
            "name": "Soul Tome",
            "text": "The arcanaloth has a magic tome. While holding or carrying the tome, the arcanaloth can use its Banishing Claw action.\n\tThe tome has AC 17; HP 35; and Immunity to Necrotic, Poison, and Psychic damage. The tome regains all its Hit Points at the end of every turn, but it turns to dust if reduced to 0 Hit Points or when the arcanaloth dies. If the tome is destroyed, the arcanaloth can create a new one when it finishes a Short or Long Rest."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The arcanaloth makes three Fiendish Burst attacks. It can replace one attack with a Banishing Claw attack."
          },
          {
            "name": "Fiendish Burst",
            "text": "Melee or Ranged Attack Roll: +9, reach 5 ft. or range 120 ft. Hit: 31 (4d12 + 5) Necrotic damage.",
            "attack": "Fiendish Burst|+9|4d12+5"
          },
          {
            "name": "Banishing Claw (Requires Soul Tome)",
            "text": "Melee Attack Roll: +9, reach 5 ft. Hit: 10 (2d4 + 5) Slashing damage plus 19 (3d12) Psychic damage. If the target is a creature, it is subjected to the following effect. Charisma Saving Throw: DC 17. Failure: The target is trapped in a demiplane inside the Soul Tome. While trapped there, the target has the Incapacitated condition. At the end of each of its turns, the target repeats the save, escaping the tome on a success. When the target escapes, it appears in the space it left or, if that space is occupied, the nearest unoccupied space.\n\tIf the target fails three of these saves while in the demiplane, it becomes bound to the tome and can escape only if the tome is reduced to 0 Hit Points.",
            "attack": [
              "Banishing Claw|+9|2d4+5",
              "Psychic Damage||3d12"
            ]
          },
          {
            "name": "Spellcasting",
            "text": "The arcanaloth casts one of the following spells, requiring no Material components and using Intelligence as the spellcasting ability (spell save DC 17):\n\n\t• At will: Alter Self, Detect Magic, Identify, Mage Hand, Prestidigitation\n\t• 1/Day each: Contact Other Plane, Detect Thoughts, Dimension Door, Mind Blank"
          },
          {
            "name": "Teleport (Bonus Action)",
            "text": "The arcanaloth teleports up to 30 feet to an unoccupied space it can see."
          }
        ],
        "reaction": {
          "name": "Counterspell",
          "text": "The arcanaloth casts Counterspell in response to that spell's trigger, using the same spellcasting ability as Spellcasting."
        },
        "spells": "Alter Self [2024], Detect Magic [2024], Identify [2024], Mage Hand [2024], Prestidigitation [2024], Contact Other Plane [2024], Detect Thoughts [2024], Dimension Door [2024], Mind Blank [2024]",
        "description": "While all yugoloths are fiendish manifestations of wickedness and greed, arcanaloths bend their considerable intellects toward hoarding and exploiting secrets. They then deploy these secrets to ensnare countless victims and lesser villains, beguiling foes with false promises and powerful magic.\n\tArcanaloths possess considerable spellcasting prowess and frequently disguise themselves with magic. While they prefer to let magical servants or other yugoloths do their fighting for them, arcanaloths can defend themselves with arcane might, banishing opponents into the pages of their magic tomes.\n\nSource:\tMonster Manual 2024 p. 19",
        "environment": "planar (lower)"
      },
      {
        "name": "Arch-hag [2024]",
        "sortname": "Hag, Arch-hag",
        "ancestry": "Hag",
        "size": "L",
        "type": "fey",
        "alignment": "neutral evil",
        "ac": "20",
        "hp": "333 (29d10+174)",
        "speed": "40 ft.",
        "init": "16",
        "str": "24",
        "dex": "15",
        "con": "23",
        "int": "19",
        "wis": "19",
        "cha": "25",
        "save": "Wis +11, Dex +9",
        "skill": "Persuasion +21, Deception +14, Perception +11",
        "passive": "21",
        "languages": "all",
        "cr": "21",
        "vulnerable": null,
        "resist": "cold, fire, psychic",
        "immune": null,
        "conditionImmune": "charmed, exhaustion, frightened",
        "senses": "truesight 60 ft.",
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+7"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Legendary Resistance (4/Day, or  5/Day in Lair)",
            "recharge": "5/DAY",
            "text": "If the hag fails a saving throw, it can choose to succeed instead."
          },
          {
            "name": "Magic Resistance",
            "text": "The hag has Advantage on saving throws against spells and other magical effects."
          },
          {
            "name": "Spiteful Escape",
            "text": "When the hag drops to 0 Hit Points, it dies only if it is within 30 feet of its anathema (a thing the DM chooses as the hag's most hated thing). Otherwise, the hag drops to 1 Hit Point and teleports to a harmless demiplane, and it can't return to the plane it left for 2d6 days. When the hag teleports away, each creature within 60 feet of the space it left is cursed. Until the curse ends, a creature has Disadvantage on ability checks and saving throws, and the hag knows its location anywhere in the multiverse.",
            "attack": "Spiteful Escape||2d6"
          },
          {
            "name": "Coven Magic",
            "text": "While within 30 feet of at least two hag allies, the hag can cast one of the following spells, requiring no Material components, using the spell's normal casting time, and using Intelligence as the spellcasting ability (spell save DC 19): Augury, Find Familiar, Identify, Locate Object, Scrying, or Unseen Servant. The hag must finish a Long Rest before using this trait to cast that spell again."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The hag makes two Spectral Claw attacks and uses Crackling Wave."
          },
          {
            "name": "Spectral Claw",
            "text": "Melee or Ranged Attack Roll: +14, reach 10 ft. or range 60 ft. Hit: 17 (3d6 + 7) Force damage. If the target is a Large or smaller creature, it has the Prone condition.",
            "attack": "Spectral Claw|+14|3d6+7"
          },
          {
            "name": "Crackling Wave",
            "text": "Dexterity Saving Throw: DC 22, each creature in a 60-foot Cone. Failure: 32 (5d12) Lightning damage. Success: Half damage. Failure or Success: The target is cursed until the end of the hag's next turn. The target can't take Reactions until the curse ends.",
            "attack": "Crackling Wave||5d12"
          },
          {
            "name": "Spellcasting",
            "text": "The hag casts one of the following spells, requiring no Material components and using Charisma as the spellcasting ability (spell save DC 22):\n\n\t• At will: Detect Thoughts, Dimension Door, Dispel Magic, Hypnotic Pattern\n\t• 2/Day each: Mass Suggestion, Modify Memory, Plane Shift"
          },
          {
            "name": "Witch Strike (Bonus Action)",
            "text": "Each creature cursed by the hag and within 60 feet of it takes 14 (4d6) Lightning damage.",
            "attack": "Witch Strike||4d6"
          }
        ],
        "reaction": {
          "name": "Tongue Twister",
          "text": "The hag casts Counterspell in response to that spell's trigger, using the same spellcasting ability as Spellcasting. If the target fails its saving throw, it is cursed until the end of its next turn. Until the curse ends, the target can't cast spells with a Verbal component, and when it speaks, it says the opposite of what it means."
        },
        "legendary": [
          {
            "name": "Legendary Actions (3/Turn)",
            "recharge": "3/TURN",
            "text": "The Arch-hag can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The Arch-hag regains spent legendary actions at the start of its turn."
          },
          {
            "name": "Hag's Swipe",
            "text": "The hag makes one Spectral Claw attack."
          },
          {
            "name": "Malicious Magic",
            "text": "The hag uses Spellcasting to cast Dimension Door or Hypnotic Pattern. The hag can't take this action again until the start of its next turn."
          },
          {
            "@category": "lair",
            "name": "Arch-hag Lairs",
            "text": "Each arch-hag creates a magical home, such as a hidden demiplane, a mansion atop a storm cloud, or—in the case of the arch-hag Baba Yaga—a hut atop giant chicken legs. The interiors of these lairs frequently change or exhibit bewildering features.\n\tThe region containing an arch-hag's lair is altered by its presence, creating the following effects:\n\nLapsus Linguae: Creatures (excluding the hag and its allies) within 1 mile of the lair subtract 1d10 from any ability checks they make when they take the Influence action.\n\nMeddlesome Magic: Whenever a creature other than the hag or its allies finishes a Long Rest while within 1 mile of the lair, the next time that creature casts a spell using a spell slot, it also casts Confusion centered on itself. The spell uses the creature's spellcasting ability and doesn't require Concentration.\n\nIf the arch-hag is destroyed or moves its lair elsewhere, these effects end immediately."
          }
        ],
        "spells": "Detect Thoughts [2024], Dimension Door [2024], Dispel Magic [2024], Hypnotic Pattern [2024], Mass Suggestion [2024], Modify Memory [2024], Plane Shift [2024]",
        "description": "Immortal and unpredictable, arch-hags hoard secrets and strike magical bargains, altering fate to indulge their fickle whims. These timeless schemers pursue the secrets of the multiverse and work strange magic in pursuit of their inscrutable goals.\n\tArch-hags are unpredictable, self-interested, and greedy, with bizarre fascinations and affectations. Nevertheless, they often make deals to further their plots. These hags are fonts of secret knowledge, particularly lore regarding forbidden magic and multiversal secrets. They might share their knowledge, but their secrets always have a price. In trade for their secrets, arch-hags might request peculiar errands, valuable magic items, or preternatural currency, like one's memories, a year of one's life, or the ability to cry.\n\tMost arch-hags avoid battle, but if forced to fight, they unleash dangerous magic, such as spectral claws, arcing lightning, and mind-bending spells. An arch-hag can curse other magic-users, confounding the spellcasters' incantations and forcing the spellcasters to say the opposite of what they mean. Even if an arch-hag is brought low, its preparations allow it to magically slip away and begin plotting its revenge.\n\tEvery arch-hag has a unique weakness tied to a fateful encounter the hag had in the past or something that embodies the antithesis of the hag's magic. A hag goes out of its way to keep this vulnerability secret. Although an arch-hag isn't physically harmed by its weakness, it can be destroyed only while its weakness is nearby. Roll on or choose a result from the Arch-hag Anathemas table to inspire an arch-hag's weakness.\n\nArch-hag Anathemas:\n1d10 | The Arch-hag's Weakness Is...\n1 | The bones of the arch-hag's first love.\n2 | A devil's tear.\n3 | An egg with a miniature castle inside.\n4 | A flower that blooms only when time stops.\n5 | A gift from the hag's twin.\n6 | The multiverse's worst pun.\n7 | One of the hag's missing teeth.\n8 | Snow from the top of Mount Celestia.\n9 | A star pulled from the sky.\n10 | A thread from the Lady of Pain's robes.\n\nSource:\tMonster Manual 2024 p. 21",
        "environment": "any"
      },
      {
        "name": "Archelon [2024]",
        "size": "H",
        "type": "beast (dinosaur)",
        "alignment": "unaligned",
        "ac": "17",
        "hp": "90 (12d12+12)",
        "speed": "20 ft., swim 80 ft.",
        "init": "3",
        "str": "18",
        "dex": "16",
        "con": "13",
        "int": "4",
        "wis": "14",
        "cha": "6",
        "save": null,
        "skill": "Stealth +5",
        "passive": "12",
        "languages": null,
        "cr": "4",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+2"
          },
          {
            "name": "Amphibious",
            "text": "The archelon can breathe air and water."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The archelon makes two Bite attacks."
          },
          {
            "name": "Bite",
            "text": "Melee Attack Roll: +6, reach 5 ft. Hit: 14 (3d6 + 4) Piercing damage.",
            "attack": "Bite|+6|3d6+4"
          }
        ],
        "description": "Source:\tMonster Manual 2024 p. 349",
        "environment": "underwater"
      },
      {
        "name": "Archmage [2024]",
        "sortname": "Mage, Archmage",
        "ancestry": "Mage",
        "size": "S",
        "type": "humanoid",
        "alignment": "neutral",
        "ac": "17",
        "hp": "170 (31d8+31)",
        "speed": "30 ft.",
        "init": "6",
        "str": "10",
        "dex": "14",
        "con": "12",
        "int": "20",
        "wis": "15",
        "cha": "16",
        "save": "Wis +6, Int +9",
        "skill": "Arcana +13, History +9, Perception +6",
        "passive": "16",
        "languages": "Common plus five other languages",
        "cr": "12",
        "vulnerable": null,
        "resist": null,
        "immune": "psychic",
        "conditionImmune": "charmed (with Mind Blank)",
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+4"
          },
          {
            "name": "Gear",
            "text": "Wand"
          },
          {
            "name": "Treasure",
            "text": "Arcana: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme.\nIndividual: The monster doesn't have a treasure hoard, but it might keep monetary treasure."
          },
          {
            "name": "Size",
            "text": "Small, Medium"
          },
          {
            "name": "Magic Resistance",
            "text": "The archmage has Advantage on saving throws against spells and other magical effects."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The archmage makes four Arcane Burst attacks."
          },
          {
            "name": "Arcane Burst",
            "text": "Melee or Ranged Attack Roll: +9, reach 5 ft. or range 150 ft. Hit: 27 (4d10 + 5) Force damage.",
            "attack": "Arcane Burst|+9|4d10+5"
          },
          {
            "name": "Spellcasting",
            "text": "The archmage casts one of the following spells, using Intelligence as the spellcasting ability (spell save DC 17):\n\n\t• At will: Detect Magic, Detect Thoughts, Disguise Self, Invisibility, Light, Mage Armor (included in AC), Mage Hand, Prestidigitation\n\t• 2/Day each: Fly, Lightning Bolt (level 7 version)\n\t• 1/Day each: Cone of Cold (level 9 version), Mind Blank (cast before combat), Scrying, Teleport"
          },
          {
            "name": "Misty Step (3/Day) (Bonus Action)",
            "recharge": "3/DAY",
            "text": "The mage casts Misty Step, using the same spellcasting ability as Spellcasting."
          }
        ],
        "reaction": {
          "name": "Protective Magic (3/Day)",
          "recharge": "3/DAY",
          "text": "The archmage casts Counterspell or Shield in response to the spell's trigger, using the same spellcasting ability as Spellcasting."
        },
        "spells": "Cone of Cold [2024], Detect Magic [2024], Detect Thoughts [2024], Disguise Self [2024], Fly [2024], Invisibility [2024], Light [2024], Lightning Bolt [2024], Mage Armor [2024], Mage Hand [2024], Mind Blank [2024], Misty Step [2024], Prestidigitation [2024], Scrying [2024], Teleport [2024]",
        "description": "Mages are magical wonder-workers, ranging from spellcasting overlords to reclusive witches. They study mystical secrets and possess insight into monsters, legends, omens, and other lore. Mages often gather allies or hire assistants to aid them in their research or to attain magical might.\n\tRoll on or choose a result from the Mage Roles table to inspire different sorts of mages.\n\nMage Roles:\n1d10 | The Mage Is...\n1 | An astronomer who draws magic from stars.\n2 | An author who writes about the occult.\n3 | A magical engineer who creates wonders.\n4 | An oracle who interprets omens.\n5 | A prodigy with a remarkable magical heritage.\n6 | A psion whose powers manifest as spells.\n7 | A scholar investigating ancient lore.\n8 | A soothsayer who advises rulers.\n9 | A war mage who aids soldiers in battle.\n10 | A witch who shares secret wisdom.\n\nArchmage:\nArchmages have mastered incredible magical power. While some use their magic to protect the world, others become tyrants or pursue forbidden secrets. Many archmages retain magical servants and collect magic items and occult lore.\n\nSource:\tMonster Manual 2024 p. 199",
        "environment": "any"
      },
      {
        "name": "Archpriest [2024]",
        "sortname": "Priest, Archpriest",
        "ancestry": "Priest",
        "size": "S",
        "type": "humanoid",
        "alignment": "neutral",
        "ac": "16",
        "hp": "240 (32d8+96)",
        "speed": "30 ft.",
        "init": "5",
        "str": "16",
        "dex": "12",
        "con": "17",
        "int": "14",
        "wis": "21",
        "cha": "14",
        "save": "Str +7, Wis +9, Con +7, Int +6",
        "skill": "Insight +9, Medicine +9, Perception +9, Religion +10",
        "passive": "19",
        "languages": "Common plus two other languages",
        "cr": "12",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+4"
          },
          {
            "name": "Gear",
            "text": "Chain Mail, Holy Symbol"
          },
          {
            "name": "Treasure",
            "text": "Individual: The monster doesn't have a treasure hoard, but it might keep monetary treasure.\nRelics: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme."
          },
          {
            "name": "Size",
            "text": "Small, Medium"
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The archpriest makes three Radiant Burst attacks."
          },
          {
            "name": "Radiant Burst",
            "text": "Melee or Ranged Attack Roll: +9, reach 5 ft. or range 60 ft. Hit: 27 (4d10 + 5) Radiant damage.",
            "attack": "Radiant Burst|+9|4d10+5"
          },
          {
            "name": "Holy Word (Recharge 4-6)",
            "text": "Wisdom Saving Throw: DC 17, each enemy in a 20-foot Emanation originating from the archpriest. Failure: 21 (6d6) Radiant damage, and the target has the Stunned condition until the end of the archpriest's next turn. Success: Half damage only.",
            "recharge": "D4"
          },
          {
            "name": "Spellcasting",
            "text": "The archpriest casts one of the following spells, requiring no Material components and using Wisdom as the spellcasting ability (spell save DC 17):\n\nAt will: Light, Thaumaturgy\n\n1/Day each: Flame Strike (level 6 version), Greater Restoration, Raise Dead, Zone of Truth"
          },
          {
            "name": "Divine Aid (3/Day) (Bonus Action)",
            "recharge": "3/DAY",
            "text": "The priest casts Bless, Dispel Magic, Healing Word, or Lesser Restoration, using the same spellcasting ability as Spellcasting."
          }
        ],
        "description": "Priests harness the power of faith to work miracles. These religious adherents are as diverse as the faiths they follow. Some obey gods and their servants, while others live by age-old creeds. Belief guides priests' actions and their magic, which they use to shape the world in line with their ideologies.\n\tRoll on or choose a result from the Priest Roles table to inspire different sorts of priests.\n\nPriest Roles:\n1d10 | The Priest Is...\n1 | An ascetic who keeps wicked spirits at bay.\n2 | An elder who speaks for the dead.\n3 | An exorcist who hunts wicked spirits.\n4 | A follower of a god no one has heard of.\n5 | A mediator and teacher of traditional ways.\n6 | A philosopher devoted to a concept, multiversal view, or plane of existence.\n7 | The reincarnation of an ancient faith leader.\n8 | A ritualist who uses tinctures and performances to access the divine.\n9 | A shaman whose medicines ease many ills.\n10 | A zealot who wages war for a divine cause.\n\nArchpriest:\nBy forging connections with divine beings and mastering mystical truths, archpriests become conduits for godly intentions and other supernatural forces. Their magic allows them to work wonders, whether to share the benevolence of their faiths or to vent divine wrath. Some archpriests attract vast followings as they claim to speak for divine forces, while others undertake personal spiritual journeys and seek to transcend mortal concerns.\n\nSource:\tMonster Manual 2024 p. 248",
        "environment": "any"
      },
      {
        "name": "Assassin [2024]",
        "size": "S",
        "type": "humanoid",
        "alignment": "neutral",
        "ac": "16",
        "hp": "97 (15d8+30)",
        "speed": "30 ft.",
        "init": "10",
        "str": "11",
        "dex": "18",
        "con": "14",
        "int": "16",
        "wis": "11",
        "cha": "10",
        "save": "Dex +7, Int +6",
        "skill": "Stealth +10, Acrobatics +7, Perception +6",
        "passive": "16",
        "languages": "Common, Thieves' cant",
        "cr": "8",
        "vulnerable": null,
        "resist": "poison",
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+3"
          },
          {
            "name": "Gear",
            "text": "Light Crossbow, Shortsword, Studded Leather Armor"
          },
          {
            "name": "Treasure",
            "text": "Implements: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme.\nIndividual: The monster doesn't have a treasure hoard, but it might keep monetary treasure."
          },
          {
            "name": "Size",
            "text": "Small, Medium"
          },
          {
            "name": "Evasion",
            "text": "If the assassin is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, the assassin instead takes no damage if it succeeds on the save and only half damage if it fails. It can't use this trait if it has the Incapacitated condition."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The assassin makes three attacks, using Shortsword or Light Crossbow in any combination."
          },
          {
            "name": "Shortsword",
            "text": "Melee Attack Roll: +7, reach 5 ft. Hit: 7 (1d6 + 4) Piercing damage plus 17 (5d6) Poison damage, and the target has the Poisoned condition until the start of the assassin's next turn.",
            "attack": [
              "Shortsword|+7|1d6+4",
              "Poison Damage||5d6"
            ]
          },
          {
            "name": "Light Crossbow",
            "text": "Ranged Attack Roll: +7, range 80/320 ft. Hit: 8 (1d8 + 4) Piercing damage plus 21 (6d6) Poison damage.",
            "attack": [
              "Light Crossbow|+7|1d8+4",
              "Poison Damage||6d6"
            ]
          },
          {
            "name": "Cunning Action (Bonus Action)",
            "text": "The assassin takes the Dash, Disengage, or Hide action."
          }
        ],
        "description": "Assassins are professional killers skilled at stealthily approaching their victims and striking unseen. Most assassins kill for a reason, perhaps hiring themselves out to wealthy patrons or slaying for an unscrupulous cause. They use poisons and other deadly tools, and they might carry equipment to help them break into secure areas or avoid capture.\n\tMany assassins adhere to a professional code or exhibit some signature quirk. Roll on or choose a result from the Assassin Modus Operandi table to inspire an assassin's distinctive habits.\n\nAssassin Modus Operandi:\n1d6 | The Assassin Is Infamous For...\n1 | Arranging their victims in artful tableaux.\n2 | Hiding within large objects, such as suits of armor or hollow furnishings.\n3 | Leaving behind a signature item, such as a calling card, flower, seashell, or tooth.\n4 | Posing as celebrities, holy people, or servants.\n5 | Taking trophies from their victims.\n6 | Using poison with a distinctive color or smell.\n\nSource:\tMonster Manual 2024 p. 22",
        "environment": "any"
      },
      {
        "name": "Awakened Shrub [2024]",
        "sortname": "Awakened Plant, Shrub",
        "ancestry": "Awakened Plant",
        "size": "S",
        "type": "plant",
        "alignment": "neutral",
        "ac": "9",
        "hp": "10 (3d6)",
        "speed": "20 ft.",
        "init": "-1",
        "str": "3",
        "dex": "8",
        "con": "11",
        "int": "10",
        "wis": "10",
        "cha": "6",
        "save": null,
        "skill": null,
        "passive": "10",
        "languages": "Common plus one other language",
        "cr": "0",
        "vulnerable": null,
        "resist": "piercing",
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": {
          "name": "Rake",
          "text": "Melee Attack Roll: +1, reach 5 ft. Hit: 1 Slashing damage.",
          "attack": "Rake|+1|1"
        },
        "description": "Magic can invest plants with mobility, sapience, and even a voice. Spells such as A wak en or the influence of other planes of existence might bring mundane vegetation to life, while other remarkable plants might naturally have these features.\n\nAwakened shrubs can be any sort of small plant, from forest bushes to clustered flowers. They often appear near awakened trees or in regions imbued with primal magic. Some have whimsical appearances or foliage resembling rudimentary facial features, while others look like animate topiary creatures.\n\nSource:\tMonster Manual 2024 p. 23",
        "environment": "forest"
      },
      {
        "name": "Awakened Tree [2024]",
        "sortname": "Awakened Plant, Tree",
        "ancestry": "Awakaned Plant",
        "size": "H",
        "type": "plant",
        "alignment": "neutral",
        "ac": "13",
        "hp": "59 (7d12+14)",
        "speed": "20 ft.",
        "init": "-2",
        "str": "19",
        "dex": "6",
        "con": "15",
        "int": "10",
        "wis": "10",
        "cha": "7",
        "save": null,
        "skill": null,
        "passive": "10",
        "languages": "Common plus one other language",
        "cr": "2",
        "vulnerable": null,
        "resist": "bludgeoning, piercing",
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": {
          "name": "Slam",
          "text": "Melee Attack Roll: +6, reach 10 ft. Hit: 13 (2d8 + 4) Bludgeoning damage.",
          "attack": "Slam|+6|2d8+4"
        },
        "description": "Magic can invest plants with mobility, sapience, and even a voice. Spells such as Awaken or the influence of other planes of existence might bring mundane vegetation to life, while other remarkable plants might naturally have these features.\n\nSome awakened trees stand in still, meditative states for long periods, making them easy to mistake for normal plants, while others patrol regions of natural power. Awakened trees are sometimes brought to life by influences from the Feywild, which make them colorful and endlessly blooming, or by Shadowfell energy, which covers them with grotesque burls or makes them look lifeless.\n\nSource:\tMonster Manual 2024 p. 23",
        "environment": "forest"
      },
      {
        "name": "Axe Beak [2024]",
        "size": "L",
        "type": "monstrosity",
        "alignment": "unaligned",
        "ac": "11",
        "hp": "19 (3d10+3)",
        "speed": "50 ft.",
        "init": "1",
        "str": "14",
        "dex": "12",
        "con": "12",
        "int": "2",
        "wis": "10",
        "cha": "5",
        "save": null,
        "skill": null,
        "passive": "10",
        "languages": null,
        "cr": "1/4",
        "vulnerable": null,
        "resist": null,
        "immune": null,
        "conditionImmune": null,
        "senses": null,
        "trait": {
          "name": "Proficiency Bonus",
          "text": "+2"
        },
        "action": {
          "name": "Beak",
          "text": "Melee Attack Roll: +4, reach 5 ft. Hit: 5 (1d6 + 2) Slashing damage.",
          "attack": "Beak|+4|1d6+2"
        },
        "description": "Axe beaks are flightless, birdlike creatures with distinctive axe-shaped beaks. Swift predators, they chase down prey and use their beaks to hack through foliage protecting their quarry. Axe beaks live in varied environments. Colorfully plumed axe beaks race across tropical plains, while axe beaks with snowy feathers hunt the tundra.\n\tAxe beaks are diﬃcult to train, but those hatched and raised in captivity can become reliable mounts.\n\nAlone or in small groups, axe beaks stalk prey to feed their flocks. When working together, axe beaks use rudimentary tactics, with some distracting threats while others strike vulnerable targets or rush young axe beaks to safety.\n\nSource:\tMonster Manual 2024 p. 24",
        "environment": "arctic, grassland, hill"
      },
      {
        "name": "Azer Pyromancer [2024]",
        "size": "M",
        "type": "elemental",
        "alignment": "lawful neutral",
        "ac": "18",
        "hp": "97 (13d8+39)",
        "speed": "30 ft.",
        "init": "2",
        "str": "15",
        "dex": "14",
        "con": "16",
        "int": "12",
        "wis": "18",
        "cha": "13",
        "save": "Wis +7, Con +6",
        "skill": "Arcana +4, Perception +7",
        "passive": "17",
        "languages": "Primordial (Ignan)",
        "cr": "6",
        "vulnerable": null,
        "resist": null,
        "immune": "fire, poison",
        "conditionImmune": "poisoned",
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+3"
          },
          {
            "name": "Treasure",
            "text": "Armaments: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme.\nIndividual: The monster doesn't have a treasure hoard, but it might keep monetary treasure."
          },
          {
            "name": "Fire Aura",
            "text": "At the end of each of the azer's turns, each creature of the azer's choice in a 5-foot Emanation originating from the azer takes 11 (2d10) Fire damage unless the azer has the Incapacitated condition.",
            "attack": "Fire Aura||2d10"
          },
          {
            "name": "Illumination",
            "text": "The azer sheds Bright Light in a 10-foot radius and Dim Light for an additional 10 feet."
          }
        ],
        "action": [
          {
            "name": "Multiattack",
            "text": "The azer makes two Flame Burst attacks."
          },
          {
            "name": "Flame Burst",
            "text": "Melee or Ranged Attack Roll: +7, reach 5 ft. or range 120 ft. Hit: 15 (2d10 + 4) Fire damage.",
            "attack": "Flame Burst|+7|2d10+4"
          },
          {
            "name": "Spellcasting",
            "text": "The azer casts one of the following spells, requiring no Material components and using Wisdom as the spellcasting ability (spell save DC 15):\n\n\t• At will: Elementalism, Mage Hand\n\t• 1/Day: Fireball"
          }
        ],
        "reaction": {
          "name": "Hellish Rebuke (2/Day)",
          "recharge": "2/DAY",
          "text": "The azer casts Hellish Rebuke in response to that spell's trigger, using the same spellcasting ability as Spellcasting."
        },
        "spells": "Elementalism [2024], Mage Hand [2024], Fireball [2024]",
        "description": "Azers are living bronze folk who work the primal elements of creation to craft weapons and magical wonders among the multiverse's mightiest infernos.\n\nAzer pyromancers conjure flames from the Elemental Plane of Fire to defend themselves and stoke magical forges.\n\nSource:\tMonster Manual 2024 p. 25",
        "environment": "mountain, planar (elemental plane of fire)"
      },
      {
        "name": "Azer Sentinel [2024]",
        "size": "M",
        "type": "elemental",
        "alignment": "lawful neutral",
        "ac": "17",
        "hp": "39 (6d8+12)",
        "speed": "30 ft.",
        "init": "1",
        "str": "17",
        "dex": "12",
        "con": "15",
        "int": "12",
        "wis": "13",
        "cha": "10",
        "save": "Con +4",
        "skill": null,
        "passive": "11",
        "languages": "Primordial (Ignan)",
        "cr": "2",
        "vulnerable": null,
        "resist": null,
        "immune": "fire, poison",
        "conditionImmune": "poisoned",
        "senses": null,
        "trait": [
          {
            "name": "Proficiency Bonus",
            "text": "+2"
          },
          {
            "name": "Treasure",
            "text": "Armaments: The monster's treasure hoard features magic items with the noted theme. The Dungeon Master's Guide details treasure hoards appropriate for each theme.\nIndividual: The monster doesn't have a treasure hoard, but it might keep monetary treasure."
          },
          {
            "name": "Fire Aura",
            "text": "At the end of each of the azer's turns, each creature of the azer's choice in a 5-foot Emanation originating from the azer takes 5 (1d10) Fire damage unless the azer has the Incapacitated condition.",
            "attack": "Fire Aura||1d10"
          },
          {
            "name": "Illumination",
            "text": "The azer sheds Bright Light in a 10-foot radius and Dim Light for an additional 10 feet."
          }
        ],
        "action": {
          "name": "Burning Hammer",
          "text": "Melee Attack Roll: +5, reach 5 ft. Hit: 8 (1d10 + 3) Bludgeoning damage plus 3 (1d6) Fire damage.",
          "attack": [
            "Burning Hammer|+5|1d10+3",
            "Fire Damage||1d6"
          ]
        },
        "description": "Azers are living bronze folk who work the primal elements of creation to craft weapons and magical wonders among the multiverse's mightiest infernos.\n\nAzer sentinels defend their communities' smiths and channel their flames through their weapons.\n\nSource:\tMonster Manual 2024 p. 25",
        "environment": "mountain, planar (elemental plane of fire)"
      }
    ]
  }
}